<?php

namespace App\Services;  // Убедитесь, что пространство имен указано правильно

use function PHPUnit\Framework\isEmpty;

class LKPService
{
    private $rects = [
        'bodyLeftFrontDoor' => ['x' => 191.4, 'y' => 337.7],
        'bodyLeftSill' => ['x' => 234.1, 'y' => 337.7],
        'bodyLeftCenterPillar' => ['x' => 271.2, 'y' => 337.7],
        'bodyLeftBackDoor' => ['x' => 308.4, 'y' => 337.7],
        'bodyLeftBackPillar' => ['x' => 505.3, 'y' => 246.8],
        'bodyLeftBackFender' => ['x' => 505.3, 'y' => 272.8],
        'bodyLeftFrontPillar' => ['x' => 0.1, 'y' => 246.8],
        'bodyLeftFrontFender' => ['x' => 0.1, 'y' => 272.8],
        'leftTaillight' => ['x' => 505.3, 'y' => 220.8],
        'rightTaillight' => ['x' => 505.3, 'y' => 117],
        'bodyTrunkLid' => ['x' => 505.3, 'y' => 142.9],
        'bodyHood' => ['x' => 0.1, 'y' => 146.6],
        'bodyFrontBumper' => ['x' => 0.1, 'y' => 168.9],
        'bodyGrille' => ['x' => 0.1, 'y' => 191.2],
        'bodyBackBumper' => ['x' => 505.3, 'y' => 194.9],
        'bodyRightFrontDoor' => ['x' => 191.4, 'y' => 0.1],
        'bodyRightSill' => ['x' => 234.1, 'y' => 0.1],
        'bodyRightCenterPillar' => ['x' => 271.2, 'y' => 0.1],
        'bodyRightBackDoor' => ['x' => 308.4, 'y' => 0.1],
        'bodyRightBackFender' => ['x' => 505.3, 'y' => 65],
        'bodyRightFrontFender' => ['x' => 0.1, 'y' => 65],
        'bodyRightBackPillar' => ['x' => 505.3, 'y' => 91],
        'bodyRightFrontPillar' => ['x' => 0.1, 'y' => 91],
    ];
    
    // Массив для текстов
    private $texts = [
        'bodyLeftFrontFender' => ['x' => 16.35, 'y' => 283.6],
        'bodyLeftFrontDoor' => ['x' => 208.65, 'y' => 348.5],
        'bodyLeftFrontPillar' => ['x' => 17.35, 'y' => 257.6],
        'bodyLeftRoofPart' => ['x' => 288, 'y' => 205.5],
        'bodyRoofBackPart' => ['x' => 319.6, 'y' => 183.2],
        'bodyRightRoofPart' => ['x' => 288, 'y' => 157.4],
        'bodyRoofFrontPart' => ['x' => 260.5, 'y' => 181.2],
        'bodyLeftCenterPillar' => ['x' => 287.45, 'y' => 348.5],
        'bodyLeftBackPillar' => ['x' => 521.55, 'y' => 258.6],
        'bodyLeftBackDoor' => ['x' => 324.65, 'y' => 348.5],
        'bodyLeftBackFender' => ['x' => 521.55, 'y' => 283.6],
        'bodyLeftSill' => ['x' => 250.35, 'y' => 347.5],
        'bodyTrunkLid' => ['x' => 521.55, 'y' => 154.7],
        'bodyBackBumper' => ['x' => 521.55, 'y' => 206.7],
        'bodyRightBackFender' => ['x' => 521.55, 'y' => 75.8],
        'bodyRightBackDoor' => ['x' => 324.65, 'y' => 10.9],
        'bodyRightBackPillar' => ['x' => 521.55, 'y' => 101.8],
        'bodyRightCenterPillar' => ['x' => 287.45, 'y' => 10.9],
        'bodyRightFrontPillar' => ['x' => 16.35, 'y' => 101.8],
        'bodyRightFrontDoor' => ['x' => 207.65, 'y' => 10.9],
        'bodyRightFrontFender' => ['x' => 16.35, 'y' => 75.8],
        'bodyRightSill' => ['x' => 250.35, 'y' => 10.9],
        'bodyFrontBumper' => ['x' => 16.35, 'y' => 179.7],
        'bodyHood' => ['x' => 16.35, 'y' => 157.4],
        'bodyGrille' => ['x' => 16.35, 'y' => 202,],
        'leftTaillight' => ['x' => 521.55, 'y' => 231.6],
        'rightTaillight' => ['x' => 521.55, 'y' => 127.8],
    ];

    private $keysOfInterest = [
        'bodyLeftFrontFender' => [
            'name' => 'Левое переднее крыло',
            'type' => 'left',
        ], 
        'bodyLeftFrontDoor' => [
            'name' => 'Левая передняя дверь',
            'type' => 'left',
        ], 
        'bodyLeftFrontPillar' => [
            'name' => 'Левая передняя стойка',
            'type' => 'left',
        ], 
        'bodyLeftRoofPart' => [
            'name' => 'Левая часть крыши',
            'type' => 'left',
        ], 
        'bodyLeftCenterPillar' => [
            'name' => 'Левая средняя стойка',
            'type' => 'left',
        ], 
        'bodyLeftBackPillar' => [
            'name' => 'Левая задняя стойка',
            'type' => 'left',
        ], 
        'bodyLeftBackDoor' => [
            'name' => 'Левая задняя дверь',
            'type' => 'left',
        ], 
        'bodyLeftBackFender' => [
            'name' => 'Левое заднее крыло',
            'type' => 'left',
        ], 
        'bodyLeftSill' => [
            'name' => 'Левый порог',
            'type' => 'left',
        ], 
        'bodyRoofBackPart' => [
            'name' => 'Задняя часть крыши',
            'type' => 'back',
        ], 
        'bodyTrunkLid' => [
            'name' => 'Крышка / дверь багажника',
            'type' => 'back',
        ], 
        'bodyBackBumper' => [
            'name' => 'Задний бампер',
            'type' => 'back',
        ], 

        'bodyRightBackFender' => [
            'name' => 'Правое заднее крыло',
            'type' => 'right',
        ], 
        'bodyRightBackDoor' => [
            'name' => 'Правая задняя дверь',
            'type' => 'right',
        ], 
        'bodyRightBackPillar' => [
            'name' => 'Правая задняя стойка',
            'type' => 'right',
        ], 
        'bodyRightCenterPillar' => [
            'name' => 'Правая средняя стойка',
            'type' => 'right',
        ], 
        'bodyRightRoofPart' => [
            'name' => 'Правая часть крыши',
            'type' => 'right',
        ], 
        'bodyRightFrontPillar' => [
            'name' => 'Правая передняя стойка',
            'type' => 'right',
        ], 
        'bodyRightFrontDoor' => [
            'name' => 'Правая передняя дверь',
            'type' => 'right',
        ], 
        'bodyRightFrontFender' => [
            'name' => 'Правое переднее крыло',
            'type' => 'right',
        ], 
        'bodyRightSill' => [
            'name' => 'Правый порог',
            'type' => 'right',
        ], 

        'bodyRoofFrontPart' => [
            'name' => 'Передняя часть крыши',
            'type' => 'front',
        ], 
        'bodyFrontBumper' => [
            'name' => 'Передний бампер',
            'type' => 'front',
        ], 
        'bodyHood' => [
            'name' => 'Капот',
            'type' => 'front',
        ], 
        'bodyGrille' => [
            'name' => 'Решетка радиатора',
            'type' => 'front',
        ],

        'leftMirror' => [
            'name' => 'Левое зеркало',
            'type' => 'glass',
        ],
        'leftFrontGlass' => [
            'name' => 'Левое переднее стекло',
            'type' => 'glass',
        ],
        'leftBackGlass' => [
            'name' => 'Левое заднее стекло',
            'type' => 'glass',
        ],
        'backGlass' => [
            'name' => 'Заднее стекло',
            'type' => 'glass',
        ],
        'leftTaillight' => [
            'name' => 'Левый задний фонарь',
            'type' => 'glass',
        ],
        'rightTaillight' => [
            'name' => 'Правый задний фонарь',
            'type' => 'glass',
        ],
        'rightBackGlass' => [
            'name' => 'Правое заднее стекло',
            'type' => 'glass',
        ],
        'rightFrontGlass' => [
            'name' => 'Правое переднее стекло',
            'type' => 'glass',
        ],
        'rightMirror' => [
            'name' => 'Правое зеркало',
            'type' => 'glass',
        ],
        'frontGlass' => [
            'name' => 'Лобовое стекло',
            'type' => 'glass',
        ],
        'leftHeadlight' => [
            'name' => 'Левая фара',
            'type' => 'glass',
        ],
        'leftFogLight' => [
            'name' => 'Левая противотуманная фара',
            'type' => 'glass',
        ],
        'rightHeadlight' => [
            'name' => 'Правая фара',
            'type' => 'glass',
        ],
        'rightFogLight' => [
            'name' => 'Правая противотуманная фара',
            'type' => 'glass',
        ],
    ];

    private $damages_names = [
        'body' => [
            '1' => [
                'name' => 'Скол',
                'color' => 'warning'
            ],
            '2' => [
                'name' => 'Притёртость',
                'color' => 'warning'
            ],
            '3' => [
                'name' => 'Царапина',
                'color' => 'warning'
            ],
            '4' => [
                'name' => 'Коррозия',
                'color' => 'warning'
            ],
            '5' => [
                'name' => 'Вмятина',
                'color' => 'warning'
            ],
            '6' => [
                'name' => 'Крашеный элемент',
                'color' => 'danger'
            ],
            '7' => [
                'name' => 'Заметен ремонт (плохой окрас)',
                'color' => 'danger'
            ],
            '8' => [
                'name' => 'Деталь отсутствует',
                'color' => 'danger'
            ],
            '9' => [
                'name' => 'Деталь заменена',
                'color' => 'danger'
            ],
            '10' => [
                'name' => 'Трещина',
                'color' => 'danger'
            ],
            '11' => [
                'name' => 'Другое',
                'color' => 'warning'
            ],
            '12' => [
                'name' => 'Вздутие краски',
                'color' => 'danger'
            ],
            '13' => [
                'name' => 'Отслоение лака',
                'color' => 'warning'
            ],
        ],
        'glass' => [
            '1' => [
                'name' => 'Скол',
                'color' => 'warning'
            ],
            '2' => [
                'name' => 'Царапина',
                'color' => 'warning'
            ],
            '3' => [
                'name' => 'Заметен ремонт',
                'color' => 'danger'
            ],
            '4' => [
                'name' => 'Деталь отсутствует',
                'color' => 'warning'
            ],
            '5' => [
                'name' => 'Деталь заменена',
                'color' => 'warning'
            ],
            '6' => [
                'name' => 'Трещина',
                'color' => 'danger'
            ],
            '7' => [
                'name' => 'Другое',
                'color' => 'warning'
            ],
            '8' => [
                'name' => 'Запотевание',
                'color' => 'danger'
            ],
        ]
    ];

    private $colors = [
        'warning' => '#fffdaf',
        'danger' => '#FF7276',
    ];
    
    private $lkp_data = null;
    private $damages_list = null;


    public function __construct($lkp_data = null, $damages_list = null)
    {
        $this->lkp_data = $lkp_data;
        $this->damages_list = $damages_list;
    }

    public function generateSvgElements()
    {

        $svg_elements = [];
        foreach ($this->keysOfInterest as $key => $data) {
            if(isset($this->damages_list[$key]) && isset($this->damages_list[$key][0])){
                $type = 'body';
                if($data['type'] == 'glass'){
                    $type = 'glass';
                }
                $color = $this->damages_names[$type][$this->damages_list[$key][0]]['color'];
                $svg_elements[] = "<style type=\"text/css\">.part-{$key}{fill: {$this->colors[$color]};</style>";
            }
            if(isset($this->rects[$key])){
                $rect = $this->rects[$key];
                $svg_elements[] = "<rect id=\"rect-{$key}\" x=\"{$rect['x']}\" y=\"{$rect['y']}\" width=\"32.5\" height=\"17.6\" class=\"st6\"/>";
            }
            if(isset($this->texts[$key])){
                $text = $this->texts[$key];
                if(isset($this->lkp_data[$key])){
                    $content = null;
                    $lkp = $this->lkp_data[$key];
                    if($lkp["min"] != null){
                        $content = $lkp["min"];
                        if($lkp["max"] != null){
                            $content .= ' - ';
                        }
                    }
                    if($lkp["max"] != null){
                        $content .= $lkp["max"];
                    }

                    if($content != null){
                        $svg_elements[] = "<text id=\"text-{$key}\" x=\"{$text['x']}\" y=\"{$text['y']}\" text-anchor=\"middle\" dominant-baseline=\"middle\" class=\"st7 st8\">$content</text>";
                    }
                }

            }
        }
        return $svg_elements;
    }

    public function generateTable(){
        $tableData = [];
        foreach ($this->keysOfInterest as $key => $data) {
            $content = '';
            $color = null;
            if(isset($this->lkp_data[$key])){
                $lkp = $this->lkp_data[$key];
                if($lkp["min"] != null){
                    $content = $lkp["min"];
                    if($lkp["max"] != null){
                        $content .= ' - ';
                    }
                }
                if($lkp["max"] != null){
                    $content .= $lkp["max"];
                }
            }
            
            $problems = '';
            if(isset($this->damages_list[$key]) && isset($this->damages_list[$key][0])){
                $i = 0;
                foreach ($this->damages_list[$key] as $value) {
                    $i++;
                    $type = 'body';
                    if($data['type'] == 'glass'){
                        $type = 'glass';
                    }
                    $problems .= $this->damages_names[$type][$value]['name'];

                    if($i < count($this->damages_list[$key])){
                        $problems .= ', ';
                    }
                }
                $color = $this->damages_names[$type][$this->damages_list[$key][0]]['color'];
            }
            $tableData[$data['type']][] = [
                'name' => $data['name'],
                'problems' => $problems,
                'lkp' => $content,
                'note' => $color
            ];
        }
        return $tableData;
    }

    public function generateSvg(){
         // Объединить все элементы в одну строку SVG
         $svg_str = '<svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
              viewBox="0 0 537.9 355.4" style="enable-background:new 0 0 537.9 355.4;" xml:space="preserve">
            <style type="text/css">
                .st0{fill:#FFFFFF;}
                .st1{fill-rule:evenodd;clip-rule:evenodd;fill:#141516;}
                .st2{fill-rule:evenodd;clip-rule:evenodd;fill:#FFFFFF;}
                .st3{fill:#E1F6FF;}
                .st4{fill-rule:evenodd;clip-rule:evenodd;fill:#E1F6FF;}
                .st5{fill:#141516;}
                .st6{fill:none;stroke:#000000;stroke-width:0.1856;}
            
                .st7{font-family:"Roboto-Regular";}
                .st8{font-size:6px;}
                .st9{font-size:6px;}
            
            </style>'; 
         $svg_elements = $this->generateSvgElements();

         foreach ($svg_elements as $element) {
             $svg_str .= $element . "\n";
         }

         $svg_str .= $this->getEndOfSvg();
         return base64_encode($svg_str);
         return $svg_str;


    }

    protected function getEndOfSvg(){
        return '
        <!-- Детали -->
        <g>
            <g>
                <rect class="part-bodyLeftSill st0" x="198.3" y="292.7" width="133.7" height="13"/>
                <path class="st1" d="M333.9,305.7v-11.1H196.5v11.1H333.9z M333,304.8H197.4v-9.3H333L333,304.8L333,304.8z"/>
            </g>
            <g>
                <!-- Не нужно -->
                <rect x="244.8" y="211.1" class="st0" width="94.7" height="7.4"/>
                <path class="st1" d="M340.4,218.5v-7.4h-96.6v7.4H340.4z M339.5,217.6h-94.7V212h94.7L339.5,217.6L339.5,217.6z"/>
            </g>
            <g>
                <polygon class="part-bodyLeftBackPillar st0" points="387.8,233.4 387.8,246.3 339.5,246.3 339.5,211.1 341.4,211.1 "/>
                <path class="st1" d="M387.8,233.4l-46.4-22.3h-1.9v35.2h48.3V233.4z M386.9,233.9v11.5h-46.4V212h0.7L386.9,233.9z"/>
            </g>
            <g>
                <path class="part-bodyLeftBackFender st2" d="M417.2,242.3l-29.4-8.9l-18.6,11.1h-37.1v61.2h13V304c0-15.4,12.5-27.8,27.9-27.8s27.9,12.5,27.9,27.8v1.7H425
                    c4.1,0,7.4-3.3,7.4-7.4v-25.6c0-1.4-0.2-2.8-0.6-4.1l-4.6-16.2C425.8,247.6,422,243.7,417.2,242.3z"/>
                <path class="st1" d="M401.7,304.8V304c0-15.9-12.9-28.8-28.8-28.8s-28.8,12.9-28.8,28.8v0.8H333v-59.4h36.5l18.4-11l29,8.8l0,0
                    c4.5,1.4,8.1,4.9,9.4,9.5l4.6,16.2c0.4,1.2,0.5,2.5,0.5,3.8v25.6c0,3.6-2.9,6.5-6.5,6.5L401.7,304.8L401.7,304.8z M417.2,242.3
                    l-29.4-8.9l-18.6,11.1h-37.1v61.2h13V304c0-15.4,12.5-27.8,27.9-27.8s27.9,12.5,27.9,27.8v1.7H425c4.1,0,7.4-3.3,7.4-7.4v-25.6
                    c0-1.4-0.2-2.8-0.6-4.1l-4.6-16.2C425.8,247.6,422,243.7,417.2,242.3z"/>
            </g>
            <g>
                <path class="st0 part-bodyLeftFrontPillar"  d="M237.7,212.7l-58,28.1v7.4h65v-37.1C242.3,211.1,239.9,211.7,237.7,212.7z"/>
                <path class="st1" d="M179.8,240.8l58-28.1c1.9-0.9,4-1.5,6.1-1.6c0.3,0,0.6,0,0.9,0v37.1h-65L179.8,240.8L179.8,240.8z M238.1,213.5
                    c1.8-0.9,3.7-1.4,5.7-1.5v35.2h-63.2v-5.9L238.1,213.5z"/>
            </g>
            <g>
                <path class="st2 part-bodyLeftFrontFender" d="M198.3,305.7v-59.4l-11.1-9.1l-7.4,3.6l-46.2,8.4c-16.4,2.9-30.2,13.9-36.8,29.2c-0.4,1-0.6,2-0.6,3.1v16.8
                    c0,4.1,3.3,7.4,7.4,7.4h22.3V304c0-15.4,12.5-27.8,27.9-27.8s27.8,12.4,27.8,27.8v1.7L198.3,305.7L198.3,305.7z"/>
                <path class="st1" d="M187.2,237.2l11.1,9.1v59.4h-16.7V304c0-15.4-12.5-27.8-27.9-27.8s-27.9,12.5-27.9,27.8v1.7h-22.2
                    c-4.1,0-7.4-3.3-7.4-7.4v-16.8c0-1.1,0.2-2.1,0.6-3.1c6.6-15.3,20.4-26.2,36.8-29.2l46.2-8.4L187.2,237.2z M180.1,241.7l-46.3,8.4
                    c-16.1,2.9-29.6,13.6-36.1,28.6c-0.4,0.9-0.6,1.8-0.6,2.8v16.8c0,3.6,2.9,6.5,6.5,6.5H125V304c0-15.9,12.9-28.8,28.8-28.8
                    s28.8,12.9,28.8,28.8v0.8h14.9v-58l-10.3-8.5L180.1,241.7z"/>
            </g>
            <g>
                <path class="part-leftFrontGlass st3" d="M287.5,214.8h-30.3c-6.9,0-13.6,1.9-19.5,5.5l-39.3,24.2h89.2v-29.7H287.5z"/>
                <path class="st1" d="M287.5,246.3h-89.2v-1.9l39.3-24.2c5.9-3.6,12.6-5.5,19.5-5.5h30.3v31.6H287.5z M286.6,215.7h-29.4
                    c-6.7,0-13.3,1.9-19,5.4L199.3,245v0.4h87.3V215.7z"/>
            </g>
            <g>
                <path class="part-leftBackGlass st3" d="M289.4,214.8h41.9c2.9,0,5.8,0.9,8.3,2.5l28.2,19.1c2.1,1.4,3.3,3.7,3.3,6.2v1.9h-81.7V214.8z"/>
                <path class="st1" d="M339,218.1l28.2,19.1c1.8,1.2,2.9,3.2,2.9,5.4v2.9h-79.9v-29.7h41C334,215.7,336.7,216.6,339,218.1z
                    M367.8,236.4c2.1,1.4,3.3,3.7,3.3,6.2v3.8h-81.7v-31.5h41.9c2.9,0,5.8,0.9,8.3,2.5L367.8,236.4z"/>
            </g>
            <!-- Колесо -->
            <g>
                <path class="st2" d="M153.8,315.1c-6.2,0-11.1-5-11.1-11.1s5-11.1,11.1-11.1c6.2,0,11.1,5,11.1,11.1S159.9,315.1,153.8,315.1z
                    M153.8,329.9c-14.4,0-26-11.6-26-26c0-14.3,11.6-26,26-26s26,11.6,26,26S168.1,329.9,153.8,329.9z"/>
                <path class="st1" d="M142.6,304c0,6.1,5,11.1,11.1,11.1c6.2,0,11.1-5,11.1-11.1s-5-11.1-11.1-11.1
                    C147.6,292.8,142.6,297.8,142.6,304z M127.8,304c0,14.3,11.6,26,26,26s26-11.6,26-26c0-14.3-11.6-26-26-26S127.8,289.6,127.8,304z
                    M153.8,316c-6.7,0-12.1-5.4-12.1-12.1c0-6.7,5.4-12.1,12.1-12.1s12.1,5.4,12.1,12.1C165.8,310.6,160.4,316,153.8,316z M128.7,304
                    c0,13.8,11.2,25,25.1,25c13.8,0,25.1-11.2,25.1-25s-11.2-25-25.1-25C139.9,278.9,128.7,290.1,128.7,304z"/>
            </g>
            <!-- Колесо -->
            <g>
                <path class="st2" d="M372.9,315.1c-6.2,0-11.1-5-11.1-11.1s5-11.1,11.1-11.1s11.1,5,11.1,11.1C384.1,310.1,379.1,315.1,372.9,315.1z
                    M372.9,329.9c-14.4,0-26-11.6-26-26c0-14.3,11.6-26,26-26s26,11.6,26,26S387.3,329.9,372.9,329.9z"/>
                <path class="st1" d="M361.8,304c0,6.1,5,11.1,11.1,11.1s11.1-5,11.1-11.1s-5-11.1-11.1-11.1S361.8,297.8,361.8,304z M346.9,304
                    c0,14.3,11.6,26,26,26s26-11.6,26-26c0-14.3-11.6-26-26-26S346.9,289.6,346.9,304z M372.9,316c-6.7,0-12.1-5.4-12.1-12.1
                    c0-6.7,5.4-12.1,12.1-12.1s12.1,5.4,12.1,12.1S379.6,316,372.9,316z M347.9,304c0,13.8,11.2,25,25.1,25s25.1-11.2,25.1-25
                    s-11.2-25-25.1-25S347.9,290.1,347.9,304z"/>
            </g>
            <g>
                <path class="part-bodyLeftFrontDoor st0" d="M200.4,244.5c-1.8,0-3.6,0.7-4.9,1.9l-5.8,5.2c-1.6,1.4-2.5,3.4-2.5,5.5V289c0,4.1,3.3,7.4,7.4,7.4h89.2v-51.9
                    L200.4,244.5L200.4,244.5z"/>
                <path class="st1" d="M195.5,246.4c1.4-1.2,3.1-1.9,4.9-1.9h83.3v51.9h-89.1c-4.1,0-7.4-3.3-7.4-7.4v-31.9c0-2.1,0.9-4.1,2.5-5.5
                    L195.5,246.4z M282.9,295.5h-88.3c-3.6,0-6.5-2.9-6.5-6.5v-31.9c0-1.8,0.8-3.6,2.2-4.8l5.8-5.2c1.2-1.1,2.7-1.6,4.3-1.6h82.4
                    L282.9,295.5L282.9,295.5z"/>
            </g>
            <g>
                <path class="part-bodyLeftBackDoor st0" d="M326.7,296.4h-42.9v-51.9h87.3v12.3c0,2-0.8,4-2.3,5.4L337,292.3C334.2,295,330.5,296.4,326.7,296.4z"/>
                <path class="st1" d="M368.1,261.5l-31.8,30.1c-2.6,2.5-6,3.8-9.6,3.8h-42.9v-50.1h86.4v11.4C370.1,258.6,369.4,260.3,368.1,261.5z
                    M336.9,292.3c-2.8,2.6-6.4,4.1-10.2,4.1h-43.8v-51.9h88.2v12.3c0,2-0.8,4-2.3,5.4L336.9,292.3z"/>
            </g>
            <g>
                <rect class="part-bodyLeftCenterPillar st0" x="282.9" y="214.8" width="9.3" height="30.6"/>
                <path class="st1" d="M282.9,214.8v30.6h9.3v-30.6H282.9z M291.2,215.7h-7.4v28.8h7.4V215.7z"/>
            </g>
            <!-- Ручки -->
            <g>
                <path class="st0" d="M341.4,254.7c0-1.5,1.2-2.8,2.8-2.8h13c1.5,0,2.8,1.2,2.8,2.8c0,1.5-1.2,2.8-2.8,2.8h-13
                    C342.6,257.5,341.4,256.2,341.4,254.7z"/>
                <path class="st1" d="M344.1,251.9c-1.5,0-2.8,1.2-2.8,2.8c0,1.5,1.2,2.8,2.8,2.8h13c1.5,0,2.8-1.2,2.8-2.8c0-1.5-1.2-2.8-2.8-2.8
                    H344.1z M357.1,252.8h-13c-1,0-1.9,0.8-1.9,1.9c0,1,0.8,1.9,1.9,1.9h13c1,0,1.9-0.8,1.9-1.9C359,253.7,358.2,252.8,357.1,252.8z"/>
                <path class="st0" d="M259.6,254.7c0-1.5,1.2-2.8,2.8-2.8h13c1.5,0,2.8,1.2,2.8,2.8c0,1.5-1.2,2.8-2.8,2.8h-13
                    C260.9,257.5,259.6,256.2,259.6,254.7z"/>
                <path class="st1" d="M262.4,251.9c-1.5,0-2.8,1.2-2.8,2.8c0,1.5,1.2,2.8,2.8,2.8h13c1.5,0,2.8-1.2,2.8-2.8c0-1.5-1.2-2.8-2.8-2.8
                    H262.4z M275.4,252.8h-13c-1,0-1.9,0.8-1.9,1.9c0,1,0.8,1.9,1.9,1.9h13c1,0,1.9-0.8,1.9-1.9C277.3,253.7,276.4,252.8,275.4,252.8z"
                    />
            </g>
            <g>
                <path class="part-leftMirror st0" d="M198.3,244.5c0-3.1,2.5-5.6,5.6-5.6h9.9c1.7,0,3.1,1.4,3.1,3.1v4.9c0,1.7-1.4,3.1-3.1,3.1h-9.9
                    C200.8,250.1,198.3,247.6,198.3,244.5z"/>
                <path class="st1" d="M203.9,238.9c-3.1,0-5.6,2.5-5.6,5.6s2.5,5.6,5.6,5.6h9.9c1.7,0,3.1-1.4,3.1-3.1v-4.9c0-1.7-1.4-3.1-3.1-3.1
                    L203.9,238.9L203.9,238.9z M213.8,239.8h-9.9c-2.6,0-4.6,2.1-4.6,4.6c0,2.6,2.1,4.6,4.6,4.6h9.9c1.2,0,2.2-1,2.2-2.2v-4.9
                    C216,240.8,215,239.8,213.8,239.8z"/>
            </g>
            <g>
                <path class="part-bodyBackBumper st0" d="M430.5,124.8c0-4.7,3.1-8.8,7.5-10.1c12.2-3.6,24.9-5.5,37.7-5.5c5.8,0,10.5,4.7,10.5,10.5V236
                    c0,5.8-4.7,10.4-10.4,10.4c-12.4,0-25.5-2-37.5-5.5c-4.6-1.4-7.8-5.6-7.8-10.4V124.8z"/>
                <path class="st1" d="M485.3,194.4v-31.5v-43.2c0-5.3-4.3-9.6-9.6-9.6c-12.7,0-25.3,1.9-37.4,5.5c-4.1,1.2-6.9,5-6.9,9.2v69.6v36.5
                    c0,4.2,2.8,8,6.9,9.2c12.1,3.6,24.8,5.5,37.4,5.5c5.3,0,9.6-4.3,9.6-9.6V194.4z M430.5,230.9v-68v-38.1c0-4.7,3.1-8.8,7.5-10.1
                    c12.2-3.6,24.9-5.5,37.7-5.5c5.8,0,10.5,4.7,10.5,10.5v43.2v31.5V236c0,5.8-4.7,10.5-10.5,10.5c-12.7,0-25.5-1.9-37.7-5.5
                    C433.6,239.6,430.5,235.5,430.5,230.9z"/>
            </g>
            <g>
                <path class="part-bodyTrunkLid st2" d="M387.8,129.5V226h35.5c1.1,0,2.2-0.1,3.2-0.4l26-5.8c3.4-0.8,5.8-3.8,5.8-7.2v-69.7c0-3.5-2.4-6.5-5.8-7.2
                    l-26-5.8c-1.1-0.2-2.1-0.4-3.2-0.4H387.8z"/>
                <path class="st4" d="M454.7,244.8c-5.3-0.9-10.5-2-15.6-3.5l-0.7-0.2c-0.8-0.2-1.5-0.5-2.2-0.9v-17.1c0-0.2,0-0.4,0.1-0.6l1.4-8.5
                    c0.2-1.4,1.2-2.5,2.5-2.9l9.7-3.2c2.4-0.8,4.9,1,4.9,3.5L454.7,244.8L454.7,244.8z"/>
            </g>
            <g>
                <path class="part-leftTaillight st1" d="M453.7,243.7v-32.4c0-1.9-1.9-3.2-3.7-2.6l-9.7,3.2c-1,0.3-1.7,1.2-1.9,2.2l-1.4,8.5c0,0.2,0,0.3,0,0.5v16.5
                    c0.5,0.2,1,0.4,1.6,0.6l0.7,0.2C444.1,241.7,448.9,242.8,453.7,243.7z M454.7,244.8v-33.5c0-2.5-2.5-4.3-4.9-3.5l-9.7,3.2
                    c-1.3,0.4-2.3,1.6-2.5,2.9l-1.4,8.5c0,0.2-0.1,0.4-0.1,0.6v17.1c0.7,0.4,1.4,0.7,2.2,0.9l0.7,0.2c4.8,1.4,9.7,2.5,14.7,3.4
                    C454,244.6,454.4,244.7,454.7,244.8z"/>
                <path class="st4" d="M436.1,115.5c0.6-0.3,1.3-0.6,2-0.8c5.4-1.6,11-2.9,16.6-3.8v0.1v35.7c0,2.5-2.5,4.3-4.9,3.5l-9.7-3.2
                    c-1.3-0.4-2.3-1.6-2.5-2.9l-1.4-8.6c0-0.2-0.1-0.4-0.1-0.6V115.5z"/>
            </g>
            <g>
                <path class="part-rightTaillight st1" d="M453.7,111.1c-5.3,0.9-10.5,2.1-15.7,3.7c-0.7,0.2-1.4,0.5-2,0.8v19.3c0,0.2,0,0.4,0.1,0.6l1.4,8.6
                    c0.2,1.4,1.2,2.5,2.5,2.9l9.7,3.2c2.4,0.8,4.9-1,4.9-3.5V111c0-0.1,0-0.1,0-0.1C454.4,111,454.1,111,453.7,111.1L453.7,111.1z
                    M437,116.1v18.8c0,0.2,0,0.3,0,0.5l1.4,8.6c0.2,1,0.9,1.9,1.9,2.2l9.7,3.2c1.8,0.6,3.7-0.7,3.7-2.6v-34.7
                    c-5.2,0.9-10.4,2.1-15.4,3.6C437.9,115.7,437.4,115.9,437,116.1z"/>
                <path class="st1" d="M385.9,131.3l1.9-1.9h35.5c1.1,0,2.2,0.1,3.2,0.4l26,5.8c3.4,0.8,5.8,3.8,5.8,7.2v69.8c0,3.5-2.4,6.5-5.8,7.2
                    l-26,5.8c-1.1,0.2-2.1,0.4-3.2,0.4h-35.5l-1.9-1.9V131.3z M387.8,130.4l-0.9,0.9V224l0.9,0.9h35.5c1,0,2-0.1,3-0.3l26-5.8
                    c3-0.7,5.1-3.3,5.1-6.3v-69.7c0-3-2.1-5.7-5.1-6.3l-26-5.8c-1-0.2-2-0.3-3-0.3L387.8,130.4L387.8,130.4z"/>
            </g>
            <g>
                <polygon class="part-backGlass st4" points="387.8,225.9 387.8,129.5 339.5,142.5 339.5,213 "/>
                <path class="st1" d="M386.9,224.7v-94l-46.4,12.6v69L386.9,224.7z M387.8,129.5l-48.3,13.1V213l48.3,13V129.5z"/>
            </g>

            <g>
                <rect class="part-bodyRoofBackPart part-bodyLeftRoofPart part-bodyRightRoofPart part-bodyRoofFrontPart st0" x="244.8" y="142.5" width="94.7" height="70.5"/>
                <path class="st1" d="M243.8,213h96.6v-70.5h-96.6V213z M244.8,143.4V212h94.7v-68.6L244.8,143.4L244.8,143.4z"/>
            </g>
            <g>
                <polygon class="part-frontGlass st4" points="161.2,224.1 161.2,131.3 244.8,142.5 244.8,212.9 "/>
                <path class="st1" d="M162.1,223l81.7-10.9v-68.8l-81.7-10.9L162.1,223L162.1,223z M161.2,224.1l83.6-11.1v-70.5l-83.6-11.1V224.1z"
                    />
            </g>
            <g>
                <path class="st0 part-bodyHood" d="M105.8,212.4l1.9,6.6c0.9,3,3.6,5.2,6.8,5.3l32.3,1.5c0.9,0,1.8,0,2.8-0.1l24.6-3.6v-89l-24.6-3.5
                    c-0.9-0.1-1.8-0.2-2.8-0.1l-32.3,1.5c-3.2,0.1-5.9,2.3-6.8,5.3l-1.9,6.6c-0.2,0.7-0.3,1.4-0.3,2.1v65.3
                    C105.5,211.1,105.6,211.8,105.8,212.4z"/>
                <path class="st1" d="M149.6,129.6l24.6,3.6v89l-24.6,3.6c-0.9,0.1-1.8,0.2-2.8,0.1l-32.3-1.5c-3.2-0.1-5.9-2.3-6.8-5.3l-1.9-6.6
                    c-0.2-0.7-0.3-1.4-0.3-2.1v-65.3c0-0.7,0.1-1.4,0.3-2.1l1.9-6.6c0.9-3,3.6-5.2,6.8-5.3l32.3-1.5
                    C147.7,129.5,148.7,129.5,149.6,129.6z M106.7,212.2l1.9,6.6c0.8,2.7,3.2,4.5,5.9,4.7l32.3,1.5c0.9,0,1.7,0,2.6-0.1l0,0l23.8-3.5
                    V134l-23.8-3.5l0,0c-0.9-0.1-1.7-0.2-2.6-0.1l-32.3,1.5c-2.8,0.1-5.2,2-5.9,4.7l-1.9,6.6c-0.2,0.6-0.3,1.2-0.3,1.8v65.3
                    C106.4,211,106.5,211.6,106.7,212.2z"/>
            </g>
            <g>
                <path class="part-bodyFrontBumper st0" d="M53.5,130.2v95.2c0,6.9,4.7,12.9,11.5,14.4l17.2,4c1.9,0.5,3.9,0.5,5.8,0.2l15-2.5c2.3-0.4,3.7-2.7,2.9-4.9
                    L98.5,216c-0.3-0.8-0.4-1.6-0.4-2.5v-69.9c0-0.8,0.1-1.6,0.4-2.3l7.5-22.6c0.7-2.2-0.7-4.5-2.9-4.8L88,111.4
                    c-1.9-0.3-3.9-0.3-5.8,0.2l-17.2,4C58.2,117.4,53.5,123.3,53.5,130.2z"/>
                <path class="st1" d="M53.5,225.4v-95.2c0-6.9,4.7-12.9,11.5-14.4l17.2-4c1.9-0.5,3.9-0.5,5.8-0.2l15.1,2.5c2.3,0.4,3.6,2.7,2.9,4.8
                    l-7.5,22.6c-0.3,0.8-0.4,1.5-0.4,2.3v69.9c0,0.8,0.1,1.7,0.4,2.5l7.4,20.6c0.8,2.2-0.6,4.5-2.9,4.9l-15,2.5
                    c-1.9,0.3-3.9,0.3-5.8-0.2L65,240C58.2,238.3,53.5,232.3,53.5,225.4z M54.4,130.2v95.2c0,6.5,4.4,12.1,10.7,13.5l17.2,4
                    c1.8,0.4,3.7,0.5,5.5,0.2l15-2.5c1.7-0.3,2.7-2,2.2-3.7l-7.4-20.6c-0.3-0.9-0.5-1.8-0.5-2.8v-69.9c0-0.9,0.1-1.8,0.4-2.6l7.5-22.6
                    c0.5-1.6-0.5-3.3-2.2-3.6l-15.1-2.5c-1.8-0.3-3.7-0.2-5.5,0.2l-17.2,4C58.8,118.2,54.4,123.8,54.4,130.2z"/>
            </g>
            <g>
                <path class="part-rightFogLight st3" d="M66.1,120.2c-4.9,0-8.9,4-8.9,8.9v9.3c0,1.2,1,2.2,2.2,2.2c4.9,0,8.9-4,8.9-8.9v-9.3
                    C68.3,121.2,67.3,120.2,66.1,120.2z M67.4,131.7v-9.3c0-0.7-0.6-1.3-1.3-1.3c-4.4,0-8,3.6-8,8v9.3c0,0.7,0.6,1.3,1.3,1.3
                    C63.8,139.7,67.4,136.1,67.4,131.7z"/>
                <path class="st1" d="M66.1,120.2c-4.9,0-8.9,4-8.9,8.9v9.3c0,1.2,1,2.2,2.2,2.2c4.9,0,8.9-4,8.9-8.9v-9.3
                    C68.3,121.2,67.3,120.2,66.1,120.2z M67.4,131.7v-9.3c0-0.7-0.6-1.3-1.3-1.3c-4.4,0-8,3.6-8,8v9.3c0,0.7,0.6,1.3,1.3,1.3
                    C63.8,139.7,67.4,136.1,67.4,131.7z"/>
            </g>
            <g>
                <path class="part-leftFogLight st3" d="M59.4,214.8c-1.2,0-2.2,1-2.2,2.2v9.3c0,4.9,4,8.9,8.9,8.9c1.2,0,2.2-1,2.2-2.2v-9.3
                    C68.3,218.8,64.3,214.8,59.4,214.8z M67.4,233v-9.3c0-4.4-3.6-8-8-8c-0.7,0-1.3,0.6-1.3,1.3v9.3c0,4.4,3.6,8,8,8
                    C66.8,234.3,67.4,233.7,67.4,233z"/>
                <path class="st1" d="M59.4,214.8c-1.2,0-2.2,1-2.2,2.2v9.3c0,4.9,4,8.9,8.9,8.9c1.2,0,2.2-1,2.2-2.2v-9.3
                    C68.3,218.8,64.3,214.8,59.4,214.8z M67.4,233v-9.3c0-4.4-3.6-8-8-8c-0.7,0-1.3,0.6-1.3,1.3v9.3c0,4.4,3.6,8,8,8
                    C66.8,234.3,67.4,233.7,67.4,233z"/>
            </g>
            <g>
                <path class="part-leftHeadlight st4" d="M98.2,215.3l-7.8-1.3c-2.6-0.4-4.8,1.9-4.2,4.4l1.9,8.9c1.5,6.8,7.5,11.7,14.5,11.7h3.3
                    c0.2-0.7,0.2-1.5-0.1-2.3l-7.4-20.6C98.4,215.9,98.3,215.6,98.2,215.3z"/>
                <path class="st1" d="M98.2,215.3l-7.8-1.3c-2.6-0.4-4.8,1.9-4.2,4.4l1.9,8.9c1.5,6.8,7.5,11.7,14.5,11.7h3.3
                    c0.2-0.7,0.2-1.5-0.1-2.3l-7.4-20.6C98.4,215.9,98.3,215.6,98.2,215.3z M97.5,216.1l-7.2-1.2c-1.9-0.3-3.6,1.4-3.2,3.3l1.9,8.9
                    c1.4,6.4,7.1,11,13.6,11h2.5c0-0.4,0-0.7-0.2-1.1l-7.4-20.6C97.6,216.3,97.5,216.2,97.5,216.1z"/>
            </g>
            <g>
                <path class="part-rightHeadlight st4" d="M106,116.6h-4.4c-7.4,0-13.7,5.4-14.7,12.7l-1.2,8.3c-0.4,2.5,1.8,4.6,4.2,4.2l8.8-1.3l7.2-21.6
                    C106.2,118.1,106.2,117.3,106,116.6z"/>
                <path class="st1" d="M98,139.7l-8.2,1.3l0.1,0.9l-0.1-0.9c-1.8,0.3-3.4-1.3-3.2-3.1l1.2-8.3c1-6.9,6.9-11.9,13.8-11.9h3.6
                    c0,0.3,0,0.7-0.1,1L98,139.7z M106,118.9c0.3-0.8,0.2-1.6,0-2.3h-4.4c-7.4,0-13.7,5.4-14.7,12.7l-1.2,8.3c-0.4,2.5,1.8,4.6,4.2,4.2
                    l8.8-1.3L106,118.9z"/>
            </g>
            <g>
                <path class="part-bodyGrille st0" d="M98,142.6v70.5l-10.8-1.2c-3.5-0.4-6.2-3.1-6.6-6.6L78,181.9c-0.3-2.7-0.3-5.5,0-8.2l2.6-23.4
                    c0.4-3.4,3.1-6.2,6.6-6.6L98,142.6z"/>
                <path class="st1" d="M97.1,143.6l-9.8,1.1c-3,0.3-5.4,2.7-5.7,5.7L79,173.8c-0.3,2.7-0.3,5.3,0,8l2.6,23.4c0.3,3,2.7,5.4,5.7,5.7
                    l9.8,1.1V143.6z M98,142.6l-10.8,1.2c-3.5,0.4-6.2,3.1-6.6,6.6L78,173.8c-0.3,2.7-0.3,5.5,0,8.2l2.6,23.4c0.4,3.5,3.1,6.2,6.6,6.6
                    l10.8,1.2V142.6z"/>
                <rect x="85.5" y="144.3" class="st1" width="0.9" height="66.8"/>
                <rect x="91.1" y="143.4" class="st1" width="0.9" height="68.6"/>
            </g>
            <g>
                <rect class="part-bodyRightSill st0" x="198.3" y="49.7" width="133.7" height="13"/>
                <path class="st1" d="M333.9,49.7v11.1H196.5V49.7H333.9z M333,50.6H197.4v9.3H333L333,50.6L333,50.6z"/>
            </g>
            <!-- Не нужнo -->
            <g>
                <rect x="244.8" y="136.9" class="st0" width="94.7" height="7.4"/>
                <path class="st1" d="M340.4,136.9v7.4h-96.6v-7.4H340.4z M339.5,137.8h-94.7v5.6h94.7L339.5,137.8L339.5,137.8z"/>
            </g>
            <g>
                <polygon class="part-bodyRightBackPillar st0" points="387.8,122.1 387.8,109.1 339.5,109.1 339.5,144.3 341.4,144.3 "/>
                <path class="st1" d="M387.8,122.1l-46.4,22.3h-1.9v-35.2h48.3V122.1z M386.9,121.5V110h-46.4v33.4h0.7L386.9,121.5z"/>
            </g>
            <g>
                <path class="part-bodyRightBackFender st2" d="M417.2,113.1l-29.4,8.9l-18.6-11.1h-37.1V49.7h13v1.7c0,15.4,12.5,27.8,27.9,27.8s27.9-12.5,27.9-27.8v-1.7H425
                    c4.1,0,7.4,3.3,7.4,7.4v25.6c0,1.4-0.2,2.8-0.6,4.1l-4.6,16.2C425.8,107.9,422,111.7,417.2,113.1z"/>
                <path class="st1" d="M401.7,50.6v0.8c0,15.9-12.9,28.8-28.8,28.8s-28.8-12.9-28.8-28.8v-0.8H333V110h36.5l18.4,11.1l29-8.8l0,0
                    c4.5-1.4,8.1-4.9,9.4-9.5l4.6-16.2c0.4-1.2,0.5-2.5,0.5-3.8V57.2c0-3.6-2.9-6.5-6.5-6.5h-23.2V50.6z M417.2,113.1l-29.4,8.9
                    l-18.6-11.1h-37.1V49.7h13v1.7c0,15.4,12.5,27.8,27.9,27.8s27.9-12.5,27.9-27.8v-1.7H425c4.1,0,7.4,3.3,7.4,7.4v25.6
                    c0,1.4-0.2,2.8-0.6,4.1l-4.6,16.2C425.8,107.9,422,111.7,417.2,113.1z"/>
            </g>
            <g>
                <path class="part-bodyRightFrontPillar st0" d="M237.7,142.7l-58-28.1v-7.4h65v37.1C242.3,144.3,239.9,143.8,237.7,142.7z"/>
                <path class="st1" d="M179.8,114.6l58,28.1c1.9,0.9,4,1.5,6.1,1.6c0.3,0,0.6,0,0.9,0v-37.1h-65L179.8,114.6L179.8,114.6z
                    M238.1,141.9c1.8,0.9,3.7,1.4,5.7,1.5v-35.2h-63.2v5.9L238.1,141.9z"/>
            </g>
            <g>
                <path class="part-bodyRightFrontFender st2" d="M198.3,49.7v59.4l-11.1,9.1l-7.4-3.6l-46.2-8.4c-16.4-2.9-30.2-13.9-36.8-29.2c-0.4-1-0.6-2-0.6-3.1V57.1
                    c0-4.1,3.3-7.4,7.4-7.4h22.3v1.7c0,15.4,12.5,27.8,27.9,27.8s27.9-12.5,27.9-27.8v-1.7H198.3z"/>
                <path class="st1" d="M187.2,118.2l11.1-9.1V49.7h-16.7v1.7c0,15.4-12.5,27.8-27.9,27.8s-27.9-12.5-27.9-27.8v-1.7h-22.2
                    c-4.1,0-7.4,3.3-7.4,7.4v16.8c0,1.1,0.2,2.1,0.6,3.1c6.6,15.3,20.4,26.2,36.8,29.2l46.2,8.4L187.2,118.2z M180.1,113.7l-46.3-8.4
                    c-16.1-2.9-29.6-13.6-36.1-28.6c-0.4-0.9-0.6-1.8-0.6-2.8V57.1c0-3.6,2.9-6.5,6.5-6.5H125v0.8c0,15.9,12.9,28.8,28.8,28.8
                    s28.8-12.9,28.8-28.8v-0.8h14.9v58l-10.3,8.5L180.1,113.7z"/>
            </g>
            <g>
                <path class="part-rightFrontGlass st3" d="M287.5,140.6h-30.3c-6.9,0-13.6-1.9-19.5-5.5l-39.3-24.2h89.2v29.7H287.5z"/>
                <path class="st1" d="M287.5,109.1h-89.2v1.9l39.3,24.2c5.9,3.6,12.6,5.5,19.5,5.5h30.3v-31.6H287.5z M286.6,139.7h-29.4
                    c-6.7,0-13.3-1.9-19-5.4l-38.9-23.9V110h87.3V139.7z"/>
            </g>
            <g>
                <path class="part-rightBackGlass st3" d="M289.4,140.6h41.9c2.9,0,5.8-0.9,8.3-2.5l28.2-19.1c2.1-1.4,3.3-3.7,3.3-6.2v-1.9h-81.7V140.6z"/>
                <path class="st1" d="M339,137.3l28.2-19.1c1.8-1.2,2.9-3.2,2.9-5.4v-2.9h-79.9v29.7h41C334,139.7,336.7,138.9,339,137.3z M367.8,119
                    c2.1-1.4,3.3-3.7,3.3-6.2V109h-81.7v31.6h41.9c2.9,0,5.8-0.9,8.3-2.5L367.8,119z"/>
            </g>
            <!-- Колесо -->
            <g>
                <path class="st2" d="M153.8,40.3c-6.2,0-11.1,5-11.1,11.1s5,11.1,11.1,11.1c6.2,0,11.1-5,11.1-11.1S159.9,40.3,153.8,40.3z
                    M153.8,25.5c-14.4,0-26,11.6-26,26c0,14.3,11.6,26,26,26s26-11.6,26-26S168.1,25.5,153.8,25.5z"/>
                <path class="st1" d="M142.6,51.4c0-6.1,5-11.1,11.1-11.1c6.2,0,11.1,5,11.1,11.1s-5,11.1-11.1,11.1
                    C147.6,62.6,142.6,57.6,142.6,51.4z M127.8,51.4c0-14.3,11.6-26,26-26s26,11.6,26,26c0,14.3-11.6,26-26,26S127.8,65.8,127.8,51.4z
                    M153.8,39.4c-6.7,0-12.1,5.4-12.1,12.1s5.4,12.1,12.1,12.1s12.1-5.4,12.1-12.1C165.8,44.8,160.4,39.4,153.8,39.4z M128.7,51.4
                    c0-13.8,11.2-25,25.1-25c13.8,0,25.1,11.2,25.1,25s-11.2,25-25.1,25C139.9,76.5,128.7,65.3,128.7,51.4z"/>
            </g>
            <!-- Колесо -->
            <g>
                <path class="st2" d="M372.9,40.3c-6.2,0-11.1,5-11.1,11.1s5,11.1,11.1,11.1s11.1-5,11.1-11.1C384.1,45.3,379.1,40.3,372.9,40.3z
                    M372.9,25.5c-14.4,0-26,11.6-26,26c0,14.3,11.6,26,26,26s26-11.6,26-26S387.3,25.5,372.9,25.5z"/>
                <path class="st1" d="M361.8,51.4c0-6.1,5-11.1,11.1-11.1s11.1,5,11.1,11.1s-5,11.1-11.1,11.1S361.8,57.6,361.8,51.4z M346.9,51.4
                    c0-14.3,11.6-26,26-26s26,11.6,26,26c0,14.3-11.6,26-26,26S346.9,65.8,346.9,51.4z M372.9,39.4c-6.7,0-12.1,5.4-12.1,12.1
                    s5.4,12.1,12.1,12.1S385,58.2,385,51.5C385,44.8,379.6,39.4,372.9,39.4z M347.9,51.4c0-13.8,11.2-25,25.1-25s25.1,11.2,25.1,25
                    s-11.2,25-25.1,25S347.9,65.3,347.9,51.4z"/>
            </g>
            <g>
                <path class="part-bodyRightFrontDoor st0" d="M200.4,110.9c-1.8,0-3.6-0.7-4.9-1.9l-5.8-5.2c-1.6-1.4-2.5-3.4-2.5-5.5V66.4c0-4.1,3.3-7.4,7.4-7.4h89.2v51.9
                    H200.4z"/>
                <path class="st1" d="M195.5,109c1.4,1.2,3.1,1.9,4.9,1.9h87.1V59h-92.9c-4.1,0-7.4,3.3-7.4,7.4v31.9c0,2.1,0.9,4.1,2.5,5.5
                    L195.5,109z M286.6,59.9h-92c-3.6,0-6.5,2.9-6.5,6.5v31.9c0,1.8,0.8,3.6,2.2,4.8l5.8,5.2c1.2,1.1,2.7,1.6,4.3,1.6h86.2V59.9z"/>
            </g>
            <g>
                <path class="part-bodyRightBackDoor st0" d="M326.7,59h-42.9v51.9h87.3V98.6c0-2-0.8-4-2.3-5.4L337,63.1C334.2,60.5,330.5,59,326.7,59z"/>
                <path class="st1" d="M368.1,93.9l-31.8-30.1c-2.6-2.5-6-3.8-9.6-3.8h-42.9v50.1h86.4V98.6C370.1,96.8,369.4,95.1,368.1,93.9z
                    M336.9,63.1c-2.8-2.6-6.4-4.1-10.2-4.1h-43.8v51.9h88.2V98.6c0-2-0.8-4-2.3-5.4L336.9,63.1z"/>
            </g>
            <g>
                <rect class="part-bodyRightCenterPillar st0" x="282.9" y="110" width="9.3" height="30.6"/>
                <path class="st1" d="M282.9,140.6V110h9.3v30.6H282.9z M291.2,139.7h-7.4v-28.8h7.4V139.7z"/>
            </g>
            <!-- Ручки -->
            <g>
                <path class="st0" d="M341.4,100.7c0,1.5,1.2,2.8,2.8,2.8h13c1.5,0,2.8-1.2,2.8-2.8s-1.2-2.8-2.8-2.8h-13
                    C342.6,97.9,341.4,99.2,341.4,100.7z"/>
                <path class="st1" d="M344.1,103.5c-1.5,0-2.8-1.2-2.8-2.8s1.2-2.8,2.8-2.8h13c1.5,0,2.8,1.2,2.8,2.8s-1.2,2.8-2.8,2.8H344.1z
                    M357.1,102.6h-13c-1,0-1.9-0.8-1.9-1.9c0-1,0.8-1.9,1.9-1.9h13c1,0,1.9,0.8,1.9,1.9S358.2,102.6,357.1,102.6z"/>
                <path class="st0" d="M259.6,100.7c0,1.5,1.2,2.8,2.8,2.8h13c1.5,0,2.8-1.2,2.8-2.8s-1.2-2.8-2.8-2.8h-13
                    C260.9,97.9,259.6,99.2,259.6,100.7z"/>
                <path class="st1" d="M262.4,103.5c-1.5,0-2.8-1.2-2.8-2.8s1.2-2.8,2.8-2.8h13c1.5,0,2.8,1.2,2.8,2.8s-1.2,2.8-2.8,2.8H262.4z
                    M275.4,102.6h-13c-1,0-1.9-0.8-1.9-1.9c0-1,0.8-1.9,1.9-1.9h13c1,0,1.9,0.8,1.9,1.9C277.3,101.8,276.4,102.6,275.4,102.6z"/>
            </g>
            <g>
                <path class="part-rightMirror st0" d="M198.3,110.9c0,3.1,2.5,5.6,5.6,5.6h9.9c1.7,0,3.1-1.4,3.1-3.1v-4.9c0-1.7-1.4-3.1-3.1-3.1h-9.9
                    C200.8,105.4,198.3,107.9,198.3,110.9z"/>
                <path class="st1" d="M203.9,116.5c-3.1,0-5.6-2.5-5.6-5.6s2.5-5.6,5.6-5.6h9.9c1.7,0,3.1,1.4,3.1,3.1v4.9c0,1.7-1.4,3.1-3.1,3.1
                    h-9.9V116.5z M213.8,115.6h-9.9c-2.6,0-4.6-2.1-4.6-4.6c0-2.6,2.1-4.6,4.6-4.6h9.9c1.2,0,2.2,1,2.2,2.2v4.9
                    C216,114.6,215,115.6,213.8,115.6z"/>
            </g>
        </g>
        <!-- Линии и точки -->
        <g>
            <path class="st5" d="M251.1,334.5L251.1,334.5c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C251,334.1,251.1,334.3,251.1,334.5z M251.1,330.7L251.1,330.7
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2S251.1,330.5,251.1,330.7z M251.1,326.9L251.1,326.9c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2S251.1,326.7,251.1,326.9z M251.1,323.1
                L251.1,323.1c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C251,322.7,251.1,322.9,251.1,323.1z M251.1,319.3L251.1,319.3c0,0.3-0.1,0.5-0.2,0.6
                s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C251,318.9,251.1,319.1,251.1,319.3z M251.1,315.5L251.1,315.5c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C251,315.1,251.1,315.3,251.1,315.5z
                M251.1,311.7L251.1,311.7c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2S251.1,311.5,251.1,311.7z M251.1,307.9L251.1,307.9c0,0.3-0.1,0.5-0.2,0.6
                s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                S251.1,307.7,251.1,307.9z M251.1,304.1L251.1,304.1c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C251,303.7,251.1,303.9,251.1,304.1z
                M251.1,300.3L251.1,300.3c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C251,299.9,251.1,300.1,251.1,300.3z"/>
            <path class="st5" d="M288.2,334.2L288.2,334.2c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,333.8,288.2,334,288.2,334.2z M288.2,330.4L288.2,330.4
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C288.2,330,288.2,330.2,288.2,330.4z M288.2,326.6L288.2,326.6c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C288.2,326.2,288.2,326.4,288.2,326.6z M288.2,322.8L288.2,322.8c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,322.4,288.2,322.6,288.2,322.8z
                M288.2,319L288.2,319c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5V319
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,318.6,288.2,318.8,288.2,319z M288.2,315.2L288.2,315.2
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C288.2,314.8,288.2,315,288.2,315.2z M288.2,311.4L288.2,311.4c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C288.2,311,288.2,311.2,288.2,311.4z M288.2,307.6L288.2,307.6c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,307.2,288.2,307.4,288.2,307.6z
                M288.2,303.8L288.2,303.8c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,303.4,288.2,303.5,288.2,303.8z M288.2,299.9L288.2,299.9
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C288.2,299.6,288.2,299.7,288.2,299.9z M288.2,296.1L288.2,296.1c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C288.2,295.8,288.2,295.9,288.2,296.1z M288.2,292.3L288.2,292.3c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,292,288.2,292.1,288.2,292.3z
                M288.2,288.5L288.2,288.5c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,288.2,288.2,288.3,288.2,288.5z M288.2,284.7L288.2,284.7
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C288.2,284.4,288.2,284.5,288.2,284.7z M288.2,280.9L288.2,280.9c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C288.2,280.6,288.2,280.7,288.2,280.9z M288.2,277.1L288.2,277.1c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,276.8,288.2,276.9,288.2,277.1z
                M288.2,273.3L288.2,273.3c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,273,288.2,273.1,288.2,273.3z M288.2,269.5L288.2,269.5
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C288.2,269.1,288.2,269.3,288.2,269.5z M288.2,265.7L288.2,265.7c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C288.2,265.3,288.2,265.5,288.2,265.7z M288.2,261.9L288.2,261.9c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,261.5,288.2,261.7,288.2,261.9z
                M288.2,258.1L288.2,258.1c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,257.7,288.2,257.9,288.2,258.1z M288.2,254.3L288.2,254.3
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C288.2,253.9,288.2,254.1,288.2,254.3z M288.2,250.5L288.2,250.5c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C288.2,250.1,288.2,250.3,288.2,250.5z M288.2,246.7L288.2,246.7c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,246.3,288.2,246.5,288.2,246.7z
                M288.2,242.9L288.2,242.9c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,242.5,288.2,242.7,288.2,242.9z M288.2,239.1L288.2,239.1
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C288.2,238.7,288.2,238.9,288.2,239.1z M288.2,235.3L288.2,235.3c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C288.2,234.9,288.2,235.1,288.2,235.3z M288.2,231.5L288.2,231.5c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C288.2,231.1,288.2,231.3,288.2,231.5z"/>
            <path class="st5" d="M208.4,335.1L208.4,335.1c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C208.3,334.7,208.4,334.9,208.4,335.1z M208.4,331.3L208.4,331.3c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C208.3,330.9,208.4,331.1,208.4,331.3z M208.4,327.5L208.4,327.5c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C208.3,327.1,208.4,327.3,208.4,327.5z
                M208.4,323.7L208.4,323.7c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C208.3,323.3,208.4,323.5,208.4,323.7z M208.4,319.9L208.4,319.9
                c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5
                c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C208.3,319.5,208.4,319.7,208.4,319.9z M208.4,316.1L208.4,316.1c0,0.3-0.1,0.5-0.2,0.6
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C208.3,315.7,208.4,315.9,208.4,316.1z M208.4,312.3L208.4,312.3c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C208.3,311.9,208.4,312.1,208.4,312.3z M208.4,308.5L208.4,308.5c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C208.3,308.1,208.4,308.3,208.4,308.5z M208.4,304.7L208.4,304.7c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C208.3,304.3,208.4,304.5,208.4,304.7z
                M208.4,300.9L208.4,300.9c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C208.3,300.5,208.4,300.7,208.4,300.9z M208.4,297.1L208.4,297.1
                c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5
                c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C208.3,296.7,208.4,296.9,208.4,297.1z M208.4,293.3L208.4,293.3c0,0.3-0.1,0.5-0.2,0.6
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C208.3,292.9,208.4,293.1,208.4,293.3z M208.4,289.5L208.4,289.5c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C208.3,289.1,208.4,289.3,208.4,289.5z M208.4,285.7L208.4,285.7c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C208.3,285.3,208.4,285.5,208.4,285.7z M208.4,281.9L208.4,281.9c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C208.3,281.5,208.4,281.7,208.4,281.9z M208.4,278.1L208.4,278.1c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C208.3,277.7,208.4,277.9,208.4,278.1z
                M208.4,274.3L208.4,274.3c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C208.3,273.9,208.4,274.1,208.4,274.3z M208.4,270.5L208.4,270.5
                c0,0.3-0.1,0.5-0.2,0.6c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5
                c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C208.3,270.1,208.4,270.3,208.4,270.5z"/>
            <path class="st5" d="M325.4,335.1L325.4,335.1c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C325.3,334.7,325.4,334.9,325.4,335.1z M325.4,331.3L325.4,331.3
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C325.3,330.9,325.4,331.1,325.4,331.3z M325.4,327.5L325.4,327.5c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2S325.4,327.3,325.4,327.5z
                M325.4,323.7L325.4,323.7c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2S325.4,323.5,325.4,323.7z M325.4,319.9L325.4,319.9c0,0.3-0.1,0.5-0.2,0.6
                s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C325.3,319.5,325.4,319.7,325.4,319.9z M325.4,316.1L325.4,316.1c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C325.3,315.7,325.4,315.9,325.4,316.1z
                M325.4,312.3L325.4,312.3c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C325.3,311.9,325.4,312.1,325.4,312.3z M325.4,308.5L325.4,308.5
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C325.3,308.1,325.4,308.3,325.4,308.5z M325.4,304.7L325.4,304.7c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C325.3,304.3,325.4,304.5,325.4,304.7z M325.4,300.9L325.4,300.9c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C325.3,300.5,325.4,300.7,325.4,300.9z
                M325.4,297.1L325.4,297.1c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C325.3,296.7,325.4,296.9,325.4,297.1z M325.4,293.3L325.4,293.3
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C325.3,292.9,325.4,293.1,325.4,293.3z M325.4,289.5L325.4,289.5c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C325.3,289.1,325.4,289.3,325.4,289.5z M325.4,285.7L325.4,285.7c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C325.3,285.3,325.4,285.5,325.4,285.7z
                M325.4,281.9L325.4,281.9c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1
                c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C325.3,281.5,325.4,281.7,325.4,281.9z M325.4,278.1L325.4,278.1
                c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2C325.3,277.7,325.4,277.9,325.4,278.1z M325.4,274.3L325.4,274.3c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                C325.3,273.9,325.4,274.1,325.4,274.3z M325.4,270.5L325.4,270.5c0,0.3-0.1,0.5-0.2,0.6s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5v-0.1c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2C325.3,270.1,325.4,270.3,325.4,270.5z"/>
            <path class="st5" d="M376.6,238.1L376.6,238.1c-0.2-0.2-0.3-0.4-0.3-0.6c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                l0.1,0.1c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2S376.8,238.3,376.6,238.1z M379.3,240.8L379.3,240.8
                c-0.2-0.2-0.3-0.4-0.3-0.6c0-0.2,0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2l0.1,0.1c0.1,0.1,0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2S379.5,240.9,379.3,240.8z M382,243.5L382,243.5c-0.2-0.2-0.3-0.4-0.3-0.6s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2l0.1,0.1c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                C382.3,243.7,382.2,243.6,382,243.5z M384.7,246.2L384.7,246.2c-0.2-0.2-0.3-0.4-0.3-0.6s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2l0.1,0.1c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2C385,246.4,384.9,246.3,384.7,246.2z
                M387.4,248.9L387.4,248.9c-0.2-0.2-0.3-0.4-0.3-0.6s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2l0.1,0.1
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2S387.6,249,387.4,248.9z M390.1,251.6L390.1,251.6
                c-0.2-0.2-0.3-0.4-0.3-0.6s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2l0.1,0.1c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2C390.4,251.8,390.2,251.7,390.1,251.6z M392.8,254.2L392.8,254.2c-0.2-0.2-0.3-0.4-0.3-0.6c0-0.2,0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2l0.1,0.1c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2S392.9,254.4,392.8,254.2z
                M396.3,256.4L396.3,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1
                c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C396.7,256.3,396.5,256.4,396.3,256.4z M400.1,256.4L400.1,256.4
                c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C400.5,256.3,400.4,256.4,400.1,256.4z M404,256.4L404,256.4c-0.3,0-0.5-0.1-0.6-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C404.3,256.3,404.2,256.4,404,256.4z M407.8,256.4L407.8,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C408.1,256.3,408,256.4,407.8,256.4z
                M411.6,256.4L411.6,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1
                c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C411.9,256.3,411.8,256.4,411.6,256.4z M415.4,256.4L415.4,256.4
                c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C415.8,256.3,415.6,256.4,415.4,256.4z M419.2,256.4L419.2,256.4c-0.3,0-0.5-0.1-0.6-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C419.6,256.3,419.4,256.4,419.2,256.4z M423,256.4L423,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C423.4,256.3,423.2,256.4,423,256.4z
                M426.8,256.4L426.8,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1
                c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C427.2,256.3,427,256.4,426.8,256.4z M430.6,256.4L430.6,256.4
                c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C431,256.3,430.8,256.4,430.6,256.4z M434.4,256.4L434.4,256.4c-0.3,0-0.5-0.1-0.6-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C434.8,256.3,434.6,256.4,434.4,256.4z M438.2,256.4L438.2,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C438.6,256.3,438.4,256.4,438.2,256.4z
                M442,256.4L442,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C442.4,256.3,442.2,256.4,442,256.4z M445.8,256.4L445.8,256.4c-0.3,0-0.5-0.1-0.6-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C446.2,256.3,446,256.4,445.8,256.4z M449.6,256.4L449.6,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C450,256.3,449.9,256.4,449.6,256.4z
                M453.5,256.4L453.5,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1
                c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C453.8,256.3,453.7,256.4,453.5,256.4z M457.3,256.4L457.3,256.4
                c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C457.6,256.3,457.5,256.4,457.3,256.4z M461.1,256.4L461.1,256.4c-0.3,0-0.5-0.1-0.6-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C461.4,256.3,461.3,256.4,461.1,256.4z M464.9,256.4L464.9,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C465.3,256.3,465.1,256.4,464.9,256.4z
                M468.7,256.4L468.7,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1
                c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C469.1,256.3,468.9,256.4,468.7,256.4z M472.5,256.4L472.5,256.4
                c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C472.9,256.3,472.7,256.4,472.5,256.4z M476.3,256.4L476.3,256.4c-0.3,0-0.5-0.1-0.6-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C476.7,256.3,476.5,256.4,476.3,256.4z M480.1,256.4L480.1,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C480.5,256.3,480.3,256.4,480.1,256.4z
                M483.9,256.4L483.9,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1
                c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C484.3,256.3,484.1,256.4,483.9,256.4z M487.7,256.4L487.7,256.4
                c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C488.1,256.3,487.9,256.4,487.7,256.4z M491.5,256.4L491.5,256.4c-0.3,0-0.5-0.1-0.6-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5C491.9,256.3,491.7,256.4,491.5,256.4z M495.3,256.4L495.3,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C495.7,256.3,495.5,256.4,495.3,256.4z M499.1,256.4L499.1,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                c0.1-0.1,0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C499.5,256.3,499.4,256.4,499.1,256.4
                z M503,256.4L503,256.4c-0.3,0-0.5-0.1-0.6-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2h0.1
                c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C503.3,256.3,503.2,256.4,503,256.4z"/>
            <path class="st5" d="M501.6,280.8L501.6,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C501.2,280.9,501.4,280.8,501.6,280.8z M497.8,280.8L497.8,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C497.4,280.9,497.5,280.8,497.8,280.8z M493.9,280.8L493.9,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C493.6,280.9,493.7,280.8,493.9,280.8z M490.1,280.8L490.1,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C489.8,280.9,489.9,280.8,490.1,280.8z M486.3,280.8L486.3,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C485.9,280.9,486.1,280.8,486.3,280.8z M482.5,280.8L482.5,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C482.1,280.9,482.3,280.8,482.5,280.8z
                M478.7,280.8L478.7,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C478.3,280.9,478.5,280.8,478.7,280.8z M474.9,280.8L474.9,280.8
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C474.5,280.9,474.7,280.8,474.9,280.8z M471.1,280.8L471.1,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C470.7,280.9,470.9,280.8,471.1,280.8z M467.3,280.8L467.3,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C466.9,280.9,467.1,280.8,467.3,280.8z
                M463.5,280.8L463.5,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C463.1,280.9,463.3,280.8,463.5,280.8z M459.7,280.8L459.7,280.8
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C459.3,280.9,459.5,280.8,459.7,280.8z M455.9,280.8L455.9,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C455.5,280.9,455.7,280.8,455.9,280.8z M452.1,280.8L452.1,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C451.7,280.9,451.9,280.8,452.1,280.8z
                M448.3,280.8L448.3,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C447.9,280.9,448,280.8,448.3,280.8z M444.4,280.8L444.4,280.8
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C444.1,280.9,444.2,280.8,444.4,280.8z M440.6,280.8L440.6,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C440.3,280.9,440.4,280.8,440.6,280.8z M436.8,280.8L436.8,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C436.4,280.9,436.6,280.8,436.8,280.8z
                M433,280.8L433,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H433
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C432.6,280.9,432.8,280.8,433,280.8z M429.2,280.8L429.2,280.8
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C428.8,280.9,429,280.8,429.2,280.8z M425.4,280.8L425.4,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C425,280.9,425.2,280.8,425.4,280.8z M421.6,280.8L421.6,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C421.2,280.9,421.4,280.8,421.6,280.8z
                M417.8,280.8L417.8,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C417.4,280.9,417.6,280.8,417.8,280.8z M414,280.8L414,280.8
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H414c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C413.6,280.9,413.8,280.8,414,280.8z M410.2,280.8L410.2,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C409.8,280.9,410,280.8,410.2,280.8z M406.4,280.8L406.4,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C406,280.9,406.2,280.8,406.4,280.8z"/>
            <path class="st5" d="M122.5,280.8L122.5,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C122.1,280.9,122.3,280.8,122.5,280.8z M118.7,280.8L118.7,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C118.3,280.9,118.5,280.8,118.7,280.8z M114.9,280.8L114.9,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C114.5,280.9,114.6,280.8,114.9,280.8z M111,280.8L111,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2H111c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C110.7,280.9,110.8,280.8,111,280.8
                z M107.2,280.8L107.2,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C106.9,280.9,107,280.8,107.2,280.8z M103.4,280.8L103.4,280.8
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C103,280.9,103.2,280.8,103.4,280.8z M99.6,280.8L99.6,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C99.2,280.9,99.4,280.8,99.6,280.8z M95.8,280.8L95.8,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C95.4,280.9,95.6,280.8,95.8,280.8z M92,280.8L92,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2H92c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C91.6,280.9,91.8,280.8,92,280.8z
                M88.2,280.8L88.2,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C87.8,280.9,88,280.8,88.2,280.8z M84.4,280.8L84.4,280.8
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C84,280.9,84.2,280.8,84.4,280.8z M80.6,280.8L80.6,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C80.2,280.9,80.4,280.8,80.6,280.8z M76.8,280.8L76.8,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C76.4,280.9,76.6,280.8,76.8,280.8z
                M73,280.8L73,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H73c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C72.6,280.9,72.8,280.8,73,280.8z M69.2,280.8L69.2,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C68.8,280.9,69,280.8,69.2,280.8z M65.4,280.8L65.4,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C65,280.9,65.1,280.8,65.4,280.8z
                M61.5,280.8L61.5,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C61.2,280.9,61.3,280.8,61.5,280.8z M57.7,280.8L57.7,280.8
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C57.4,280.9,57.5,280.8,57.7,280.8z M53.9,280.8L53.9,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C53.5,280.9,53.7,280.8,53.9,280.8z M50.1,280.8L50.1,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C49.7,280.9,49.9,280.8,50.1,280.8z
                M46.3,280.8L46.3,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C45.9,280.9,46.1,280.8,46.3,280.8z M42.5,280.8L42.5,280.8
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C42.1,280.9,42.3,280.8,42.5,280.8z M38.7,280.8L38.7,280.8c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C38.3,280.9,38.5,280.8,38.7,280.8z M34.9,280.8L34.9,280.8c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C34.5,280.9,34.7,280.8,34.9,280.8
                z"/>
            <path class="st5" d="M198,236.4L198,236.4c0.2-0.2,0.4-0.3,0.6-0.3s0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                l-0.1,0.1c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5C197.7,236.7,197.8,236.5,198,236.4z M195.3,239.1
                L195.3,239.1c0.2-0.2,0.4-0.3,0.6-0.3c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5l-0.1,0.1
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5S195.1,239.2,195.3,239.1z M192.6,241.8L192.6,241.8
                c0.2-0.2,0.4-0.3,0.6-0.3c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5l-0.1,0.1c-0.1,0.1-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5S192.4,241.9,192.6,241.8z M189.9,244.5L189.9,244.5c0.2-0.2,0.4-0.3,0.6-0.3
                c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5l-0.1,0.1c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5S189.7,244.6,189.9,244.5z M187.2,247.2L187.2,247.2c0.2-0.2,0.4-0.3,0.6-0.3c0.2,0,0.4,0.1,0.5,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5l-0.1,0.1c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                C187,247.5,187,247.3,187.2,247.2z M184.5,249.8L184.5,249.8c0.2-0.2,0.4-0.3,0.6-0.3c0.2,0,0.4,0.1,0.5,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5l-0.1,0.1c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                S184.3,250,184.5,249.8z M181.8,252.5L181.8,252.5c0.2-0.2,0.4-0.3,0.6-0.3c0.2,0,0.4,0.1,0.5,0.2c0.1,0.1,0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5l-0.1,0.1c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                C181.6,252.9,181.7,252.7,181.8,252.5z M179.6,254.9L179.6,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C179.2,254.9,179.4,254.9,179.6,254.9z M175.8,254.9L175.8,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C175.4,254.9,175.6,254.9,175.8,254.9z M172,254.9L172,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2H172c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C171.6,254.9,171.8,254.9,172,254.9
                z M168.2,254.9L168.2,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C167.8,254.9,168,254.9,168.2,254.9z M164.4,254.9L164.4,254.9
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C164,254.9,164.1,254.9,164.4,254.9z M160.5,254.9L160.5,254.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C160.2,254.9,160.3,254.9,160.5,254.9z M156.7,254.9L156.7,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C156.4,254.9,156.5,254.9,156.7,254.9z M152.9,254.9L152.9,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C152.5,254.9,152.7,254.9,152.9,254.9z M149.1,254.9L149.1,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C148.7,254.9,148.9,254.9,149.1,254.9z M145.3,254.9L145.3,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C144.9,254.9,145.1,254.9,145.3,254.9z M141.5,254.9L141.5,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C141.1,254.9,141.3,254.9,141.5,254.9z M137.7,254.9L137.7,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C137.3,254.9,137.5,254.9,137.7,254.9z M133.9,254.9L133.9,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C133.5,254.9,133.7,254.9,133.9,254.9z M130.1,254.9L130.1,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C129.7,254.9,129.9,254.9,130.1,254.9z M126.3,254.9L126.3,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C125.9,254.9,126.1,254.9,126.3,254.9z M122.5,254.9L122.5,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C122.1,254.9,122.3,254.9,122.5,254.9z M118.7,254.9L118.7,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C118.3,254.9,118.5,254.9,118.7,254.9z M114.9,254.9L114.9,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C114.5,254.9,114.6,254.9,114.9,254.9z M111,254.9L111,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2H111c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C110.7,254.9,110.8,254.9,111,254.9
                z M107.2,254.9L107.2,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C106.9,254.9,107,254.9,107.2,254.9z M103.4,254.9L103.4,254.9
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C103,254.9,103.2,254.9,103.4,254.9z M99.6,254.9L99.6,254.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C99.2,254.9,99.4,254.9,99.6,254.9z M95.8,254.9L95.8,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C95.4,254.9,95.6,254.9,95.8,254.9z M92,254.9L92,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2H92c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C91.6,254.9,91.8,254.9,92,254.9z
                M88.2,254.9L88.2,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C87.8,254.9,88,254.9,88.2,254.9z M84.4,254.9L84.4,254.9
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C84,254.9,84.2,254.9,84.4,254.9z M80.6,254.9L80.6,254.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C80.2,254.9,80.4,254.9,80.6,254.9z M76.8,254.9L76.8,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C76.4,254.9,76.6,254.9,76.8,254.9z
                M73,254.9L73,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H73c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C72.6,254.9,72.8,254.9,73,254.9z M69.2,254.9L69.2,254.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C68.8,254.9,69,254.9,69.2,254.9z M65.4,254.9L65.4,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C65,254.9,65.1,254.9,65.4,254.9z
                M61.5,254.9L61.5,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C61.2,254.9,61.3,254.9,61.5,254.9z M57.7,254.9L57.7,254.9
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C57.4,254.9,57.5,254.9,57.7,254.9z M53.9,254.9L53.9,254.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C53.5,254.9,53.7,254.9,53.9,254.9z M50.1,254.9L50.1,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C49.7,254.9,49.9,254.9,50.1,254.9z
                M46.3,254.9L46.3,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C45.9,254.9,46.1,254.9,46.3,254.9z M42.5,254.9L42.5,254.9
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C42.1,254.9,42.3,254.9,42.5,254.9z M38.7,254.9L38.7,254.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C38.3,254.9,38.5,254.9,38.7,254.9z M34.9,254.9L34.9,254.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C34.5,254.9,34.7,254.9,34.9,254.9
                z"/>
            <path class="st5" d="M127.8,281.6c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1
                s-0.5,0-0.7-0.1s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6s0.4-0.3,0.6-0.4
                s0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4c0.2,0.2,0.3,0.4,0.4,0.6C127.7,281.1,127.8,281.3,127.8,281.6z"/>
            <path class="st5" d="M252.2,300.1c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1
                s-0.5,0-0.7-0.1s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6
                c0.2-0.2,0.4-0.3,0.6-0.4c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4s0.3,0.4,0.4,0.6S252.2,299.9,252.2,300.1z"/>
            <path class="st5" d="M209.5,270.5c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6s-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1s-0.5,0-0.7-0.1
                s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6c0.2-0.2,0.4-0.3,0.6-0.4
                c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4c0.2,0.2,0.3,0.4,0.4,0.6C209.4,270,209.5,270.2,209.5,270.5z"/>
            <path class="st5" d="M326.5,270.5c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1
                s-0.5,0-0.7-0.1s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6
                c0.2-0.2,0.4-0.3,0.6-0.4c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4s0.3,0.4,0.4,0.6
                C326.5,270,326.5,270.2,326.5,270.5z"/>
            <path class="st5" d="M202.1,235.2c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1
                s-0.5,0-0.7-0.1s-0.4-0.2-0.6-0.4c-0.2-0.2-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6
                c0.2-0.2,0.4-0.3,0.6-0.4c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4c0.2,0.2,0.3,0.4,0.4,0.6
                C202,234.7,202.1,235,202.1,235.2z"/>
            <path class="st5" d="M289.4,231.5c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1
                s-0.5,0-0.7-0.1s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6
                c0.2-0.2,0.4-0.3,0.6-0.4c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4s0.3,0.4,0.4,0.6S289.4,231.3,289.4,231.5z"/>
            <path class="st5" d="M376.7,235.2c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1
                s-0.5,0-0.7-0.1s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6
                c0.2-0.2,0.4-0.3,0.6-0.4c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4s0.3,0.4,0.4,0.6
                C376.6,234.7,376.7,235,376.7,235.2z"/>
            <path class="st5" d="M408.2,281.6c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6s-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1s-0.5,0-0.7-0.1
                s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6c0.2-0.2,0.4-0.3,0.6-0.4
                c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4s0.3,0.4,0.4,0.6C408.2,281.1,408.2,281.3,408.2,281.6z"/>
            <path class="st5" d="M88.2,199.4L88.2,199.4c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C87.8,199.4,88,199.4,88.2,199.4z M84.4,199.4L84.4,199.4
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C84,199.4,84.2,199.4,84.4,199.4z M80.6,199.4L80.6,199.4c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C80.2,199.4,80.4,199.4,80.6,199.4z M76.8,199.4L76.8,199.4c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C76.4,199.4,76.6,199.4,76.8,199.4z
                M73,199.4L73,199.4c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H73c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C72.6,199.4,72.8,199.4,73,199.4z M69.2,199.4L69.2,199.4c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C68.8,199.4,69,199.4,69.2,199.4z M65.4,199.4L65.4,199.4c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C65,199.4,65.1,199.4,65.4,199.4z
                M61.5,199.4L61.5,199.4c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C61.2,199.4,61.3,199.4,61.5,199.4z M57.7,199.4L57.7,199.4
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C57.4,199.4,57.5,199.4,57.7,199.4z M53.9,199.4L53.9,199.4c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C53.5,199.4,53.7,199.4,53.9,199.4z M50.1,199.4L50.1,199.4c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C49.7,199.4,49.9,199.4,50.1,199.4z
                M46.3,199.4L46.3,199.4c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C45.9,199.4,46.1,199.4,46.3,199.4z M42.5,199.4L42.5,199.4
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C42.1,199.4,42.3,199.4,42.5,199.4z M38.7,199.4L38.7,199.4c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C38.3,199.4,38.5,199.4,38.7,199.4z M34.9,199.4L34.9,199.4c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C34.5,199.4,34.7,199.4,34.9,199.4
                z"/>
            <path class="st5" d="M61.5,176.5L61.5,176.5c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C61.2,176.6,61.3,176.5,61.5,176.5z M57.7,176.5L57.7,176.5
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C57.4,176.6,57.5,176.5,57.7,176.5z M53.9,176.5L53.9,176.5c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S53.7,176.5,53.9,176.5z
                M50.1,176.5L50.1,176.5c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S49.9,176.5,50.1,176.5z M46.3,176.5L46.3,176.5c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C45.9,176.6,46.1,176.5,46.3,176.5z M42.5,176.5L42.5,176.5c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S42.3,176.5,42.5,176.5z M38.7,176.5L38.7,176.5
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S38.5,176.5,38.7,176.5z M34.9,176.5L34.9,176.5c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S34.7,176.5,34.9,176.5z"/>
            <path class="st5" d="M111,154.7L111,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2H111
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S110.8,154.7,111,154.7z M107.2,154.7L107.2,154.7c0.3,0,0.5,0.1,0.6,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C106.9,154.8,107,154.7,107.2,154.7z M103.4,154.7L103.4,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S103.2,154.7,103.4,154.7z M99.6,154.7
                L99.6,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S99.4,154.7,99.6,154.7z M95.8,154.7L95.8,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C95.4,154.8,95.6,154.7,95.8,154.7z M92,154.7L92,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                H92c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S91.8,154.7,92,154.7z M88.2,154.7L88.2,154.7c0.3,0,0.5,0.1,0.6,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                S88,154.7,88.2,154.7z M84.4,154.7L84.4,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S84.2,154.7,84.4,154.7z M80.6,154.7L80.6,154.7c0.3,0,0.5,0.1,0.6,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                S80.4,154.7,80.6,154.7z M76.8,154.7L76.8,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C76.4,154.8,76.6,154.7,76.8,154.7z M73,154.7L73,154.7
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H73c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S72.8,154.7,73,154.7z M69.2,154.7L69.2,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S69,154.7,69.2,154.7z M65.4,154.7L65.4,154.7
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S65.1,154.7,65.4,154.7z M61.5,154.7L61.5,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S61.3,154.7,61.5,154.7z M57.7,154.7L57.7,154.7
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C57.4,154.8,57.5,154.7,57.7,154.7z M53.9,154.7L53.9,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S53.7,154.7,53.9,154.7z
                M50.1,154.7L50.1,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S49.9,154.7,50.1,154.7z M46.3,154.7L46.3,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C45.9,154.8,46.1,154.7,46.3,154.7z M42.5,154.7L42.5,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S42.3,154.7,42.5,154.7z M38.7,154.7L38.7,154.7
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S38.5,154.7,38.7,154.7z M34.9,154.7L34.9,154.7c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S34.7,154.7,34.9,154.7z"/>
            <path class="st5" d="M501.8,202.9L501.8,202.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C501.5,203,501.6,202.9,501.8,202.9z M498,202.9L498,202.9c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2H498c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C497.7,203,497.8,202.9,498,202.9z
                M494.2,202.9L494.2,202.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S494,202.9,494.2,202.9z M490.4,202.9L490.4,202.9
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S490.2,202.9,490.4,202.9z M486.6,202.9L486.6,202.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C486.2,203,486.4,202.9,486.6,202.9z M482.8,202.9L482.8,202.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S482.6,202.9,482.8,202.9
                z M479,202.9L479,202.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H479
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S478.8,202.9,479,202.9z M475.2,202.9L475.2,202.9
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S475,202.9,475.2,202.9z M471.4,202.9L471.4,202.9c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S471.2,202.9,471.4,202.9z"/>
            <path class="st5" d="M499.3,151L499.3,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C499,151.1,499.1,151,499.3,151z M495.5,151L495.5,151
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C495.1,151.1,495.3,151,495.5,151z M491.7,151L491.7,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S491.5,151,491.7,151z M487.9,151
                L487.9,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S487.7,151,487.9,151z M484.1,151L484.1,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C483.7,151.1,483.9,151,484.1,151z M480.3,151L480.3,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C479.9,151.1,480.1,151,480.3,151z M476.5,151L476.5,151
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S476.3,151,476.5,151z M472.7,151L472.7,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S472.5,151,472.7,151z M468.9,151L468.9,151
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S468.7,151,468.9,151z M465.1,151L465.1,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S464.9,151,465.1,151z M461.3,151L461.3,151
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C460.9,151.1,461,151,461.3,151z M457.4,151L457.4,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C457.1,151.1,457.2,151,457.4,151z M453.6,151
                L453.6,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C453.3,151.1,453.4,151,453.6,151z M449.8,151L449.8,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C449.5,151.1,449.6,151,449.8,151z M446,151
                L446,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H446c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S445.8,151,446,151z M442.2,151L442.2,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S442,151,442.2,151z M438.4,151L438.4,151
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S438.2,151,438.4,151z M434.6,151L434.6,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S434.4,151,434.6,151z M430.8,151L430.8,151
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C430.4,151.1,430.6,151,430.8,151z M427,151L427,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2H427c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S426.8,151,427,151z M423.2,151L423.2,151
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S423,151,423.2,151z M419.4,151L419.4,151c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S419.2,151,419.4,151z"/>
            <path class="st5" d="M502.5,125L502.5,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C502.1,125.1,502.3,125,502.5,125z M498.7,125L498.7,125
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S498.5,125,498.7,125z M494.9,125L494.9,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S494.7,125,494.9,125z M491.1,125
                L491.1,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C490.7,125.1,490.9,125,491.1,125z M487.3,125L487.3,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C486.9,125.1,487.1,125,487.3,125z M483.5,125L483.5,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S483.2,125,483.5,125z M479.6,125
                L479.6,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C479.3,125.1,479.4,125,479.6,125z M475.8,125L475.8,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C475.5,125.1,475.6,125,475.8,125z M472,125
                L472,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H472c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S471.8,125,472,125z M468.2,125L468.2,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S468,125,468.2,125z M464.4,125L464.4,125
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S464.2,125,464.4,125z M460.6,125L460.6,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S460.4,125,460.6,125z M456.8,125L456.8,125
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S456.6,125,456.8,125z M453,125L453,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                H453c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S452.8,125,453,125z M449.2,125L449.2,125c0.3,0,0.5,0.1,0.6,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                S449,125,449.2,125z M445.4,125L445.4,125c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S445.2,125,445.4,125z"/>
            <path class="st5" d="M502.5,228.9L502.5,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C502.1,229,502.3,228.9,502.5,228.9z M498.7,228.9L498.7,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S498.5,228.9,498.7,228.9z
                M494.9,228.9L494.9,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S494.7,228.9,494.9,228.9z M491.1,228.9L491.1,228.9
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C490.7,229,490.9,228.9,491.1,228.9z M487.3,228.9L487.3,228.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C486.9,229,487.1,228.9,487.3,228.9z M483.5,228.9L483.5,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                S483.2,228.9,483.5,228.9z M479.6,228.9L479.6,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C479.3,229,479.4,228.9,479.6,228.9z
                M475.8,228.9L475.8,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C475.5,229,475.6,228.9,475.8,228.9z M472,228.9L472,228.9
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H472c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S471.8,228.9,472,228.9z M468.2,228.9L468.2,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S468,228.9,468.2,228.9z M464.4,228.9L464.4,228.9
                c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S464.2,228.9,464.4,228.9z M460.6,228.9L460.6,228.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                S460.4,228.9,460.6,228.9z M456.8,228.9L456.8,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C456.4,229,456.6,228.9,456.8,228.9z M453,228.9
                L453,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H453c-0.2,0-0.4-0.1-0.5-0.2
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S452.8,228.9,453,228.9z M449.2,228.9L449.2,228.9c0.3,0,0.5,0.1,0.6,0.2
                c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                S449,228.9,449.2,228.9z M445.4,228.9L445.4,228.9c0.3,0,0.5,0.1,0.6,0.2c0.1,0.1,0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S445.2,228.9,445.4,228.9z"/>
            <path class="st5" d="M114.8,155.4c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6s-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1s-0.5,0-0.7-0.1
                s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6s-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6s0.4-0.3,0.6-0.4c0.2-0.1,0.5-0.1,0.7-0.1
                s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4c0.2,0.2,0.3,0.4,0.4,0.6S114.8,155.2,114.8,155.4z"/>
            <path class="st5" d="M421.2,151.7c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4s-0.5,0.1-0.7,0.1s-0.5,0-0.7-0.1
                s-0.4-0.2-0.6-0.4c-0.2-0.2-0.3-0.4-0.4-0.6s-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6c0.2-0.2,0.4-0.3,0.6-0.4
                s0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4c0.2,0.2,0.3,0.4,0.4,0.6C421.2,151.3,421.2,151.5,421.2,151.7z"/>
            <path class="st5" d="M447.2,125.8c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4s-0.5,0.1-0.7,0.1s-0.5,0-0.7-0.1
                s-0.4-0.2-0.6-0.4c-0.2-0.2-0.3-0.4-0.4-0.6s-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6c0.2-0.2,0.4-0.3,0.6-0.4
                s0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4c0.2,0.2,0.3,0.4,0.4,0.6S447.2,125.5,447.2,125.8z"/>
            <path class="st5" d="M447.2,229.6c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1
                s-0.5,0-0.7-0.1s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6
                c0.2-0.2,0.4-0.3,0.6-0.4c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4s0.3,0.4,0.4,0.6
                C447.2,229.2,447.2,229.4,447.2,229.6z"/>
            <path class="st5" d="M90.6,200c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6s-0.4,0.3-0.6,0.4s-0.5,0.1-0.7,0.1s-0.5,0-0.7-0.1
                s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6c0.2-0.2,0.4-0.3,0.6-0.4
                c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4s0.3,0.4,0.4,0.6C90.6,199.5,90.6,199.7,90.6,200z"/>
            <path class="st5" d="M473.2,203.7c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4c-0.2,0.1-0.5,0.1-0.7,0.1
                s-0.5,0-0.7-0.1s-0.4-0.2-0.6-0.4s-0.3-0.4-0.4-0.6c-0.1-0.2-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6
                c0.2-0.2,0.4-0.3,0.6-0.4c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4s0.3,0.4,0.4,0.6
                C473.2,203.2,473.2,203.4,473.2,203.7z"/>
            <path class="st5" d="M66.5,177.7c0,0.2,0,0.5-0.1,0.7s-0.2,0.4-0.4,0.6c-0.2,0.2-0.4,0.3-0.6,0.4s-0.5,0.1-0.7,0.1s-0.5,0-0.7-0.1
                c-0.2-0.1-0.4-0.2-0.6-0.4c-0.2-0.2-0.3-0.4-0.4-0.6s-0.1-0.5-0.1-0.7s0-0.5,0.1-0.7s0.2-0.4,0.4-0.6c0.2-0.2,0.4-0.3,0.6-0.4
                c0.2-0.1,0.5-0.1,0.7-0.1s0.5,0,0.7,0.1s0.4,0.2,0.6,0.4c0.2,0.2,0.3,0.4,0.4,0.6C66.4,177.2,66.5,177.5,66.5,177.7z"/>
        
        
        
        
            <path class="st5" d="M249.6,20.9L249.6,20.9c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1
                c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C249.7,21.3,249.6,21.1,249.6,20.9z M249.6,24.7L249.6,24.7
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S249.6,24.9,249.6,24.7z M249.6,28.5L249.6,28.5c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S249.6,28.7,249.6,28.5z M249.6,32.3L249.6,32.3
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S249.6,32.5,249.6,32.3z M249.6,36.1L249.6,36.1c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S249.6,36.3,249.6,36.1z M249.6,39.9L249.6,39.9
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C249.7,40.3,249.6,40.1,249.6,39.9z M249.6,43.7L249.6,43.7c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S249.6,43.9,249.6,43.7z M249.6,47.5
                L249.6,47.5c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S249.6,47.7,249.6,47.5z M249.6,51.3L249.6,51.3c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S249.6,51.6,249.6,51.3z M249.6,55.1L249.6,55.1
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S249.6,55.4,249.6,55.1z"/>
            <path class="st5" d="M286.8,21.2L286.8,21.2c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1
                c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,21.6,286.8,21.4,286.8,21.2z M286.8,25L286.8,25
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5V25c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C286.8,25.4,286.8,25.2,286.8,25z M286.8,28.8L286.8,28.8c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,29.2,286.8,29.1,286.8,28.8z M286.8,32.6
                L286.8,32.6c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C286.8,33,286.8,32.9,286.8,32.6z M286.8,36.5L286.8,36.5c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,36.8,286.8,36.7,286.8,36.5z M286.8,40.3
                L286.8,40.3c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C286.8,40.6,286.8,40.5,286.8,40.3z M286.8,44.1L286.8,44.1c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,44.4,286.8,44.3,286.8,44.1z
                M286.8,47.9L286.8,47.9c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,48.2,286.8,48.1,286.8,47.9z M286.8,51.7L286.8,51.7c0-0.3,0.1-0.5,0.2-0.6
                s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                C286.8,52,286.8,51.9,286.8,51.7z M286.8,55.5L286.8,55.5c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,55.8,286.8,55.7,286.8,55.5z M286.8,59.3L286.8,59.3
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C286.8,59.6,286.8,59.5,286.8,59.3z M286.8,63.1L286.8,63.1c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,63.5,286.8,63.3,286.8,63.1z
                M286.8,66.9L286.8,66.9c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,67.3,286.8,67.1,286.8,66.9z M286.8,70.7L286.8,70.7c0-0.3,0.1-0.5,0.2-0.6
                s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                C286.8,71.1,286.8,70.9,286.8,70.7z M286.8,74.5L286.8,74.5c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,74.9,286.8,74.7,286.8,74.5z M286.8,78.3L286.8,78.3
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C286.8,78.7,286.8,78.5,286.8,78.3z M286.8,82.1L286.8,82.1c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,82.5,286.8,82.3,286.8,82.1z
                M286.8,85.9L286.8,85.9c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,86.3,286.8,86.1,286.8,85.9z M286.8,89.7L286.8,89.7c0-0.3,0.1-0.5,0.2-0.6
                s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                C286.8,90.1,286.8,89.9,286.8,89.7z M286.8,93.5L286.8,93.5c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,93.9,286.8,93.7,286.8,93.5z M286.8,97.3L286.8,97.3
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C286.8,97.7,286.8,97.5,286.8,97.3z M286.8,101.1L286.8,101.1c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                C286.8,101.5,286.8,101.3,286.8,101.1z M286.8,104.9L286.8,104.9c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,105.3,286.8,105.1,286.8,104.9z M286.8,108.7
                L286.8,108.7c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C286.8,109.1,286.8,108.9,286.8,108.7z M286.8,112.5L286.8,112.5c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                C286.8,112.9,286.8,112.7,286.8,112.5z M286.8,116.3L286.8,116.3c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C286.8,116.7,286.8,116.5,286.8,116.3z M286.8,120.1
                L286.8,120.1c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C286.8,120.5,286.8,120.3,286.8,120.1z M286.8,123.9L286.8,123.9c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2
                s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                C286.8,124.3,286.8,124.1,286.8,123.9z"/>
            <path class="st5" d="M206.9,20.3L206.9,20.3c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1
                c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S206.9,20.5,206.9,20.3z M206.9,24.1L206.9,24.1
                c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S206.9,24.3,206.9,24.1z M206.9,27.9L206.9,27.9c0-0.3,0.1-0.5,0.2-0.6
                c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                S206.9,28.1,206.9,27.9z M206.9,31.7L206.9,31.7c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                v0.1c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S206.9,31.9,206.9,31.7z M206.9,35.5L206.9,35.5
                c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S206.9,35.7,206.9,35.5z M206.9,39.3L206.9,39.3c0-0.3,0.1-0.5,0.2-0.6
                c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                S206.9,39.5,206.9,39.3z M206.9,43.1L206.9,43.1c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                v0.1c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S206.9,43.3,206.9,43.1z M206.9,46.9L206.9,46.9
                c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C207,47.3,206.9,47.1,206.9,46.9z M206.9,50.7L206.9,50.7c0-0.3,0.1-0.5,0.2-0.6
                s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                S206.9,50.9,206.9,50.7z M206.9,54.5L206.9,54.5c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1
                c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S206.9,54.7,206.9,54.5z M206.9,58.3L206.9,58.3
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S206.9,58.5,206.9,58.3z M206.9,62.1L206.9,62.1c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S206.9,62.3,206.9,62.1z M206.9,65.9
                L206.9,65.9c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C207,66.3,206.9,66.2,206.9,65.9z M206.9,69.7L206.9,69.7c0-0.3,0.1-0.5,0.2-0.6
                c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                S206.9,70,206.9,69.7z M206.9,73.6L206.9,73.6c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1
                c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S206.9,73.8,206.9,73.6z M206.9,77.4L206.9,77.4
                c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C207,77.7,206.9,77.6,206.9,77.4z M206.9,81.2L206.9,81.2c0-0.3,0.1-0.5,0.2-0.6
                c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                C207,81.5,206.9,81.4,206.9,81.2z M206.9,85L206.9,85c0-0.3,0.1-0.5,0.2-0.6c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5V85c0,0.2-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C207,85.3,206.9,85.2,206.9,85z"/>
            <path class="st5" d="M323.9,20.3L323.9,20.3c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1
                c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S323.9,20.5,323.9,20.3z M323.9,24.1L323.9,24.1c0-0.3,0.1-0.5,0.2-0.6
                s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2
                S323.9,24.3,323.9,24.1z M323.9,27.9L323.9,27.9c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1
                c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C324,28.3,323.9,28.1,323.9,27.9z M323.9,31.7L323.9,31.7
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S323.9,31.9,323.9,31.7z M323.9,35.5L323.9,35.5c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S323.9,35.7,323.9,35.5z M323.9,39.3L323.9,39.3
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S323.9,39.5,323.9,39.3z M323.9,43.1L323.9,43.1c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S323.9,43.3,323.9,43.1z M323.9,46.9L323.9,46.9
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C324,47.3,323.9,47.1,323.9,46.9z M323.9,50.7L323.9,50.7c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S323.9,50.9,323.9,50.7z M323.9,54.5L323.9,54.5
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S323.9,54.7,323.9,54.5z M323.9,58.3L323.9,58.3c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2S323.9,58.5,323.9,58.3z M323.9,62.1L323.9,62.1
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S323.9,62.3,323.9,62.1z M323.9,65.9L323.9,65.9c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C324,66.3,323.9,66.2,323.9,65.9z M323.9,69.7
                L323.9,69.7c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2S323.9,70,323.9,69.7z M323.9,73.6L323.9,73.6c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C324,73.9,323.9,73.8,323.9,73.6z M323.9,77.4
                L323.9,77.4c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C324,77.7,323.9,77.6,323.9,77.4z M323.9,81.2L323.9,81.2c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5v0.1c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2C324,81.5,323.9,81.4,323.9,81.2z M323.9,85L323.9,85
                c0-0.3,0.1-0.5,0.2-0.6s0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5V85c0,0.2-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2C324,85.3,323.9,85.2,323.9,85z"/>
            <path class="st5" d="M377.7,118.4L377.7,118.4c-0.2,0.2-0.4,0.3-0.6,0.3s-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5l0.1-0.1
                c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5C377.9,118,377.8,118.2,377.7,118.4z M380.4,115.7L380.4,115.7
                c-0.2,0.2-0.4,0.3-0.6,0.3s-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5l0.1-0.1c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5S380.5,115.5,380.4,115.7z M383.1,113L383.1,113c-0.2,0.2-0.4,0.3-0.6,0.3s-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5l0.1-0.1c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5C383.3,112.7,383.2,112.8,383.1,113z
                M385.8,110.3L385.8,110.3c-0.2,0.2-0.4,0.3-0.6,0.3s-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5l0.1-0.1
                c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5S385.9,110.1,385.8,110.3z M388.5,107.6L388.5,107.6
                c-0.2,0.2-0.4,0.3-0.6,0.3s-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5l0.1-0.1c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5C388.7,107.3,388.6,107.5,388.5,107.6z M391.2,104.9L391.2,104.9c-0.2,0.2-0.4,0.3-0.6,0.3s-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5l0.1-0.1c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                C391.4,104.6,391.3,104.8,391.2,104.9z M393.8,102.2L393.8,102.2c-0.2,0.2-0.4,0.3-0.6,0.3s-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5l0.1-0.1c0.1-0.1,0.3-0.2,0.5-0.2s0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5S394,102.1,393.8,102.2z M396.3,100.5
                L396.3,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5C396.7,100.5,396.5,100.5,396.3,100.5z M400.1,100.5L400.1,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C400.5,100.5,400.4,100.5,400.1,100.5
                z M404,100.5L404,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C404.3,100.5,404.2,100.5,404,100.5z M407.8,100.5L407.8,100.5c-0.3,0-0.5-0.1-0.6-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C408.1,100.5,408,100.5,407.8,100.5z M411.6,100.5L411.6,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C411.9,100.5,411.8,100.5,411.6,100.5z M415.4,100.5
                L415.4,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5C415.8,100.5,415.6,100.5,415.4,100.5z M419.2,100.5L419.2,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C419.6,100.5,419.4,100.5,419.2,100.5
                z M423,100.5L423,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C423.4,100.5,423.2,100.5,423,100.5z M426.8,100.5L426.8,100.5c-0.3,0-0.5-0.1-0.6-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C427.2,100.5,427,100.5,426.8,100.5z M430.6,100.5L430.6,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C431,100.5,430.8,100.5,430.6,100.5z M434.4,100.5
                L434.4,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5C434.8,100.5,434.6,100.5,434.4,100.5z M438.2,100.5L438.2,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C438.6,100.5,438.4,100.5,438.2,100.5
                z M442,100.5L442,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C442.4,100.5,442.2,100.5,442,100.5z M445.8,100.5L445.8,100.5c-0.3,0-0.5-0.1-0.6-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C446.2,100.5,446,100.5,445.8,100.5z M449.6,100.5L449.6,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C450,100.5,449.9,100.5,449.6,100.5z M453.5,100.5
                L453.5,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5C453.8,100.5,453.7,100.5,453.5,100.5z M457.3,100.5L457.3,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C457.6,100.5,457.5,100.5,457.3,100.5
                z M461.1,100.5L461.1,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C461.4,100.5,461.3,100.5,461.1,100.5z M464.9,100.5L464.9,100.5c-0.3,0-0.5-0.1-0.6-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C465.3,100.5,465.1,100.5,464.9,100.5z M468.7,100.5L468.7,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C469.1,100.5,468.9,100.5,468.7,100.5z M472.5,100.5
                L472.5,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5C472.9,100.5,472.7,100.5,472.5,100.5z M476.3,100.5L476.3,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C476.7,100.5,476.5,100.5,476.3,100.5
                z M480.1,100.5L480.1,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C480.5,100.5,480.3,100.5,480.1,100.5z M483.9,100.5L483.9,100.5c-0.3,0-0.5-0.1-0.6-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5s0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C484.3,100.5,484.1,100.5,483.9,100.5z M487.7,100.5L487.7,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                c0.1-0.1,0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C488.1,100.5,487.9,100.5,487.7,100.5z
                M491.5,100.5L491.5,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2h0.1
                c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C491.9,100.5,491.7,100.5,491.5,100.5z M495.3,100.5L495.3,100.5
                c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5C495.7,100.5,495.5,100.5,495.3,100.5z M499.1,100.5L499.1,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                C499.5,100.5,499.4,100.5,499.1,100.5z M503,100.5L503,100.5c-0.3,0-0.5-0.1-0.6-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                c0.1-0.1,0.3-0.2,0.5-0.2h0.1c0.2,0,0.4,0.1,0.5,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5C503.3,100.5,503.2,100.5,503,100.5z"/>
            <path class="st5" d="M501.6,73.1L501.6,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C501.2,73.2,501.4,73.1,501.6,73.1z M497.8,73.1L497.8,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S497.5,73.1,497.8,73.1z M493.9,73.1L493.9,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C493.6,73.2,493.7,73.1,493.9,73.1z
                M490.1,73.1L490.1,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C489.8,73.2,489.9,73.1,490.1,73.1z M486.3,73.1L486.3,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C485.9,73.2,486.1,73.1,486.3,73.1z M482.5,73.1L482.5,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S482.3,73.1,482.5,73.1z
                M478.7,73.1L478.7,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                S478,74,478,73.8s0.1-0.4,0.2-0.5S478.5,73.1,478.7,73.1z M474.9,73.1L474.9,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S474.7,73.1,474.9,73.1z
                M471.1,73.1L471.1,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S470.9,73.1,471.1,73.1z M467.3,73.1L467.3,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S467.1,73.1,467.3,73.1z
                M463.5,73.1L463.5,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S463.3,73.1,463.5,73.1z M459.7,73.1L459.7,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2S459,74,459,73.8s0.1-0.4,0.2-0.5S459.5,73.1,459.7,73.1z
                M455.9,73.1L455.9,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S455.7,73.1,455.9,73.1z M452.1,73.1L452.1,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S451.9,73.1,452.1,73.1z
                M448.3,73.1L448.3,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C447.9,73.2,448,73.1,448.3,73.1z M444.4,73.1L444.4,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C444.1,73.2,444.2,73.1,444.4,73.1z M440.6,73.1L440.6,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C440.3,73.2,440.4,73.1,440.6,73.1z M436.8,73.1
                L436.8,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C436.4,73.2,436.6,73.1,436.8,73.1z M433,73.1L433,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H433c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S432.8,73.1,433,73.1z M429.2,73.1
                L429.2,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S429,73.1,429.2,73.1z M425.4,73.1L425.4,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S425.2,73.1,425.4,73.1z
                M421.6,73.1L421.6,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S421.4,73.1,421.6,73.1z M417.8,73.1L417.8,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S417.6,73.1,417.8,73.1z
                M414,73.1L414,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H414c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S413.8,73.1,414,73.1z M410.2,73.1L410.2,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S410,73.1,410.2,73.1z
                M406.4,73.1L406.4,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S406.2,73.1,406.4,73.1z"/>
            <path class="st5" d="M122.5,73.1L122.5,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S122.3,73.1,122.5,73.1z M118.7,73.1L118.7,73.1c0.3,0,0.5,0.1,0.6,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2S118,74,118,73.8s0.1-0.4,0.2-0.5
                S118.5,73.1,118.7,73.1z M114.9,73.1L114.9,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2
                h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S114.6,73.1,114.9,73.1z M111,73.1L111,73.1c0.3,0,0.5,0.1,0.6,0.2
                s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2H111c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                S110.8,73.1,111,73.1z M107.2,73.1L107.2,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2
                h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C106.9,73.2,107,73.1,107.2,73.1z M103.4,73.1L103.4,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S103.2,73.1,103.4,73.1z M99.6,73.1L99.6,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S99.4,73.1,99.6,73.1z M95.8,73.1
                L95.8,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C95.4,73.2,95.6,73.1,95.8,73.1z M92,73.1L92,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2H92c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S91.8,73.1,92,73.1z M88.2,73.1L88.2,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S88,73.1,88.2,73.1z M84.4,73.1L84.4,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S84.2,73.1,84.4,73.1z M80.6,73.1L80.6,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S80.4,73.1,80.6,73.1z M76.8,73.1L76.8,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C76.4,73.2,76.6,73.1,76.8,73.1z M73,73.1L73,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H73c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S72.8,73.1,73,73.1z M69.2,73.1L69.2,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S69,73.1,69.2,73.1z M65.4,73.1L65.4,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S65.1,73.1,65.4,73.1z M61.5,73.1L61.5,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S61.3,73.1,61.5,73.1z M57.7,73.1L57.7,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2S57,74,57,73.8
                s0.1-0.4,0.2-0.5C57.4,73.2,57.5,73.1,57.7,73.1z M53.9,73.1L53.9,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S53.7,73.1,53.9,73.1z M50.1,73.1L50.1,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S49.9,73.1,50.1,73.1z M46.3,73.1L46.3,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C45.9,73.2,46.1,73.1,46.3,73.1z M42.5,73.1
                L42.5,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S42.3,73.1,42.5,73.1z M38.7,73.1L38.7,73.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2S38,74,38,73.8s0.1-0.4,0.2-0.5S38.5,73.1,38.7,73.1z M34.9,73.1L34.9,73.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S34.7,73.1,34.9,73.1z"/>
            <path class="st5" d="M199,118L199,118c0.2,0.2,0.3,0.4,0.3,0.6s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2L198,119
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2C198.7,117.7,198.9,117.8,199,118z M196.3,115.3L196.3,115.3
                c0.2,0.2,0.3,0.4,0.3,0.6s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2l-0.1-0.1c-0.1-0.1-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2S196.2,115.1,196.3,115.3z M193.6,112.6L193.6,112.6c0.2,0.2,0.3,0.4,0.3,0.6
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2l-0.1-0.1c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                c0.1-0.1,0.3-0.2,0.5-0.2S193.5,112.4,193.6,112.6z M190.9,109.9L190.9,109.9c0.2,0.2,0.3,0.4,0.3,0.6s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2l-0.1-0.1c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2
                C190.6,109.7,190.8,109.8,190.9,109.9z M188.2,107.2L188.2,107.2c0.2,0.2,0.3,0.4,0.3,0.6s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2l-0.1-0.1c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2
                S188.1,107.1,188.2,107.2z M185.5,104.5L185.5,104.5c0.2,0.2,0.3,0.4,0.3,0.6s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2
                s-0.4-0.1-0.5-0.2l-0.1-0.1c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2C185.2,104.3,185.4,104.4,185.5,104.5
                z M182.9,101.8L182.9,101.8c0.2,0.2,0.3,0.4,0.3,0.6s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2s-0.4-0.1-0.5-0.2l-0.1-0.1
                c-0.1-0.1-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5c0.1-0.1,0.3-0.2,0.5-0.2C182.5,101.6,182.7,101.7,182.9,101.8z M179.6,99.1L179.6,99.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C179.2,99.1,179.4,99.1,179.6,99.1z M175.8,99.1L175.8,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C175.4,99.1,175.6,99.1,175.8,99.1z M172,99.1L172,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2H172c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C171.6,99.1,171.8,99.1,172,99.1z
                M168.2,99.1L168.2,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C167.8,99.1,168,99.1,168.2,99.1z M164.4,99.1L164.4,99.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C164,99.1,164.1,99.1,164.4,99.1z M160.5,99.1L160.5,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C160.2,99.1,160.3,99.1,160.5,99.1z
                M156.7,99.1L156.7,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C156.4,99.1,156.5,99.1,156.7,99.1z M152.9,99.1L152.9,99.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C152.5,99.1,152.7,99.1,152.9,99.1z M149.1,99.1L149.1,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C148.7,99.1,148.9,99.1,149.1,99.1z M145.3,99.1L145.3,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C144.9,99.1,145.1,99.1,145.3,99.1z
                M141.5,99.1L141.5,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C141.1,99.1,141.3,99.1,141.5,99.1z M137.7,99.1L137.7,99.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C137.3,99.1,137.5,99.1,137.7,99.1z M133.9,99.1L133.9,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C133.5,99.1,133.7,99.1,133.9,99.1z M130.1,99.1L130.1,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C129.7,99.1,129.9,99.1,130.1,99.1z
                M126.3,99.1L126.3,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C125.9,99.1,126.1,99.1,126.3,99.1z M122.5,99.1L122.5,99.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C122.1,99.1,122.3,99.1,122.5,99.1z M118.7,99.1L118.7,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C118.3,99.1,118.5,99.1,118.7,99.1z M114.9,99.1L114.9,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C114.5,99.1,114.6,99.1,114.9,99.1z
                M111,99.1L111,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2H111c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C110.7,99.1,110.8,99.1,111,99.1z M107.2,99.1L107.2,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5
                s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5
                C106.9,99.1,107,99.1,107.2,99.1z M103.4,99.1L103.4,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C103,99.1,103.2,99.1,103.4,99.1z
                M99.6,99.1L99.6,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1
                c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C99.2,99.1,99.4,99.1,99.6,99.1z M95.8,99.1L95.8,99.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C95.4,99.1,95.6,99.1,95.8,99.1z M92,99.1L92,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2H92c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S91.8,99.1,92,99.1z M88.2,99.1L88.2,99.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5S88,99.1,88.2,99.1z M84.4,99.1L84.4,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C84,99.1,84.2,99.1,84.4,99.1z M80.6,99.1
                L80.6,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C80.2,99.1,80.4,99.1,80.6,99.1z M76.8,99.1L76.8,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C76.4,99.1,76.6,99.1,76.8,99.1z M73,99.1L73,99.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2H73c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C72.6,99.1,72.8,99.1,73,99.1z M69.2,99.1L69.2,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C68.8,99.1,69,99.1,69.2,99.1z M65.4,99.1
                L65.4,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C65,99.1,65.1,99.1,65.4,99.1z M61.5,99.1L61.5,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C61.2,99.1,61.3,99.1,61.5,99.1z M57.7,99.1
                L57.7,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2S57,100,57,99.8
                s0.1-0.4,0.2-0.5C57.4,99.1,57.5,99.1,57.7,99.1z M53.9,99.1L53.9,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5S53.7,99.1,53.9,99.1z M50.1,99.1L50.1,99.1
                c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C49.7,99.1,49.9,99.1,50.1,99.1z M46.3,99.1L46.3,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C45.9,99.1,46.1,99.1,46.3,99.1z M42.5,99.1
                L42.5,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2s-0.2-0.3-0.2-0.5
                s0.1-0.4,0.2-0.5C42.1,99.1,42.3,99.1,42.5,99.1z M38.7,99.1L38.7,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5
                s-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2S38,100,38,99.8s0.1-0.4,0.2-0.5C38.3,99.1,38.5,99.1,38.7,99.1z M34.9,99.1
                L34.9,99.1c0.3,0,0.5,0.1,0.6,0.2s0.2,0.3,0.2,0.5s-0.1,0.4-0.2,0.5c-0.1,0.1-0.3,0.2-0.5,0.2h-0.1c-0.2,0-0.4-0.1-0.5-0.2
                s-0.2-0.3-0.2-0.5s0.1-0.4,0.2-0.5C34.5,99.1,34.7,99.1,34.9,99.1z"/>
            <path class="st5" d="M127.8,73.8c0-0.2,0-0.5-0.1-0.7s-0.2-0.4-0.4-0.6s-0.4-0.3-0.6-0.4c-0.2-0.1-0.5-0.1-0.7-0.1s-0.5,0-0.7,0.1
                s-0.4,0.2-0.6,0.4c-0.2,0.2-0.3,0.4-0.4,0.6c-0.1,0.2-0.1,0.5-0.1,0.7s0,0.5,0.1,0.7s0.2,0.4,0.4,0.6s0.4,0.3,0.6,0.4
                c0.2,0.1,0.5,0.1,0.7,0.1s0.5,0,0.7-0.1s0.4-0.2,0.6-0.4c0.2-0.2,0.3-0.4,0.4-0.6C127.7,74.3,127.8,74.1,127.8,73.8z"/>
            <path class="st5" d="M252.2,55.3c0-0.2,0-0.5-0.1-0.7s-0.2-0.4-0.4-0.6c-0.2-0.2-0.4-0.3-0.6-0.4s-0.5-0.1-0.7-0.1s-0.5,0-0.7,0.1
                s-0.4,0.2-0.6,0.4c-0.2,0.2-0.3,0.4-0.4,0.6s-0.1,0.5-0.1,0.7s0,0.5,0.1,0.7s0.2,0.4,0.4,0.6c0.2,0.2,0.4,0.3,0.6,0.4
                s0.5,0.1,0.7,0.1s0.5,0,0.7-0.1s0.4-0.2,0.6-0.4c0.2-0.2,0.3-0.4,0.4-0.6S252.2,55.5,252.2,55.3z"/>
            <path class="st5" d="M209.5,85c0-0.2,0-0.5-0.1-0.7s-0.2-0.4-0.4-0.6s-0.4-0.3-0.6-0.4c-0.2-0.1-0.5-0.1-0.7-0.1s-0.5,0-0.7,0.1
                s-0.4,0.2-0.6,0.4c-0.2,0.2-0.3,0.4-0.4,0.6c-0.1,0.2-0.1,0.5-0.1,0.7s0,0.5,0.1,0.7s0.2,0.4,0.4,0.6s0.4,0.3,0.6,0.4
                c0.2,0.1,0.5,0.1,0.7,0.1s0.5,0,0.7-0.1s0.4-0.2,0.6-0.4c0.2-0.2,0.3-0.4,0.4-0.6C209.4,85.4,209.5,85.2,209.5,85z"/>
            <path class="st5" d="M326.5,85c0-0.2,0-0.5-0.1-0.7s-0.2-0.4-0.4-0.6c-0.2-0.2-0.4-0.3-0.6-0.4s-0.5-0.1-0.7-0.1s-0.5,0-0.7,0.1
                s-0.4,0.2-0.6,0.4c-0.2,0.2-0.3,0.4-0.4,0.6s-0.1,0.5-0.1,0.7s0,0.5,0.1,0.7s0.2,0.4,0.4,0.6c0.2,0.2,0.4,0.3,0.6,0.4
                s0.5,0.1,0.7,0.1s0.5,0,0.7-0.1s0.4-0.2,0.6-0.4c0.2-0.2,0.3-0.4,0.4-0.6C326.5,85.4,326.5,85.2,326.5,85z"/>
            <path class="st5" d="M202.1,120.2c0-0.2,0-0.5-0.1-0.7s-0.2-0.4-0.4-0.6s-0.4-0.3-0.6-0.4c-0.2-0.1-0.5-0.1-0.7-0.1s-0.5,0-0.7,0.1
                s-0.4,0.2-0.6,0.4c-0.2,0.2-0.3,0.4-0.4,0.6c-0.1,0.2-0.1,0.5-0.1,0.7s0,0.5,0.1,0.7s0.2,0.4,0.4,0.6s0.4,0.3,0.6,0.4
                c0.2,0.1,0.5,0.1,0.7,0.1s0.5,0,0.7-0.1s0.4-0.2,0.6-0.4c0.2-0.2,0.3-0.4,0.4-0.6C202,120.7,202.1,120.5,202.1,120.2z"/>
            <path class="st5" d="M289.4,123.9c0-0.2,0-0.5-0.1-0.7s-0.2-0.4-0.4-0.6c-0.2-0.2-0.4-0.3-0.6-0.4s-0.5-0.1-0.7-0.1s-0.5,0-0.7,0.1
                s-0.4,0.2-0.6,0.4c-0.2,0.2-0.3,0.4-0.4,0.6s-0.1,0.5-0.1,0.7s0,0.5,0.1,0.7s0.2,0.4,0.4,0.6c0.2,0.2,0.4,0.3,0.6,0.4
                s0.5,0.1,0.7,0.1s0.5,0,0.7-0.1s0.4-0.2,0.6-0.4c0.2-0.2,0.3-0.4,0.4-0.6C289.3,124.4,289.4,124.2,289.4,123.9z"/>
            <path class="st5" d="M376.7,120.2c0-0.2,0-0.5-0.1-0.7s-0.2-0.4-0.4-0.6c-0.2-0.2-0.4-0.3-0.6-0.4s-0.5-0.1-0.7-0.1s-0.5,0-0.7,0.1
                s-0.4,0.2-0.6,0.4c-0.2,0.2-0.3,0.4-0.4,0.6s-0.1,0.5-0.1,0.7s0,0.5,0.1,0.7s0.2,0.4,0.4,0.6c0.2,0.2,0.4,0.3,0.6,0.4
                s0.5,0.1,0.7,0.1s0.5,0,0.7-0.1s0.4-0.2,0.6-0.4c0.2-0.2,0.3-0.4,0.4-0.6C376.6,120.7,376.7,120.5,376.7,120.2z"/>
            <path class="st5" d="M408.2,73.8c0-0.2,0-0.5-0.1-0.7s-0.2-0.4-0.4-0.6c-0.2-0.2-0.4-0.3-0.6-0.4s-0.5-0.1-0.7-0.1s-0.5,0-0.7,0.1
                s-0.4,0.2-0.6,0.4c-0.2,0.2-0.3,0.4-0.4,0.6s-0.1,0.5-0.1,0.7s0,0.5,0.1,0.7s0.2,0.4,0.4,0.6c0.2,0.2,0.4,0.3,0.6,0.4
                s0.5,0.1,0.7,0.1s0.5,0,0.7-0.1s0.4-0.2,0.6-0.4c0.2-0.2,0.3-0.4,0.4-0.6S408.2,74.1,408.2,73.8z"/>
        </g>
        
        </svg>';
    }



    
}
